{
  "fruits": [
    {
      "name": "Rocket",
      "rarity": "Common",
      "type": "Natural",
      "price_money": 5000,
      "price_robux": 50,
      "description": "Grants rocket propulsion for movement and explosive attacks. Abilities: Missile Fist, Air Strike, Rocket Crash, Blast Off.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/c/cb/Rocket_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027120039",
      "id": "rocket",
      "wiki_description": "Grants rocket propulsion for movement and explosive attacks. Abilities: Missile Fist, Air Strike, Rocket Crash, Blast Off.",
      "page_description": "Rocket (formerly known as Kilo) is a Common Natural-type Blox Fruit that costs   5,000 or   50 from the Blox Fruit Dealer.",
      "trivia": [
        "Rocket is similar to Bomb, both having moves that show explosion effects.",
        "Rocket is the cheapest fruit to have a flight ability.",
        "Rocket, Blade, and Eagle are the only fruits in which the [F] move has the highest mastery requirements out of all the other moves.",
        "A physical Rocket fruit can be purchased from Wenlock in Arowe’s room for   97 (it says Physical Kilo, but buying it still gives the Physical Rocket).\nThis makes Rocket the only fruit that can be purchased as a physical fruit for   . Interestingly, the permanent version of Rocket is cheaper, costing only   50.",
        "This makes Rocket the only fruit that can be purchased as a physical fruit for   . Interestingly, the permanent version of Rocket is cheaper, costing only   50.",
        "Rocket and Slingshot both cost the same price.",
        "Rocket, along with Spin, are the only fruits to always be in Stock.",
        "When the user is on a flat ground with no obstacles, Rocket has the fastest mobility out of all common fruits.",
        "If the user uses [F] Blast Off and quickly change to another slot, they will be able to blast themselves to the sky."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Rocket"
    },
    {
      "name": "Spin",
      "rarity": "Common",
      "type": "Natural",
      "price_money": 7500,
      "price_robux": 75,
      "description": "Allows spinning attacks and flight. Abilities: Razor Wind, Helicopter Flight, Tornado Assault, Spinning Bomber.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/8/88/Spin_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027120258",
      "id": "spin",
      "wiki_description": "Allows spinning attacks and flight. Abilities: Razor Wind, Helicopter Flight, Tornado Assault, Spinning Bomber.",
      "page_description": "Spin is a Common Natural-type Blox Fruit that costs   7,500 or   75 from the Blox Fruit Dealer.",
      "trivia": [
        "Spin fruit is based on a twisted prism, a geometric design that helps reduce wind resistance.",
        "Spin, along with Rocket, are the only fruits to always be in Stock.",
        "Despite being more expensive than Rocket, many players regard Spin worse than Rocket as the damage dealt is slightly lower and it has less stun and combo potential.",
        "Spin's pre-rework variant is used by the Marine Rear Admirals at Great Tree in the Third Sea."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Spin"
    },
    {
      "name": "Chop",
      "rarity": "Common",
      "type": "Natural",
      "price_money": 30000,
      "price_robux": 100,
      "description": "Provides immunity to sword damage and chopping abilities. Abilities: Tackle, Dance, Party, Helicopter.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/0/0e/Chop_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027115331",
      "id": "chop",
      "wiki_description": "Provides immunity to sword damage and chopping abilities. Abilities: Tackle, Dance, Party, Helicopter.",
      "page_description": "Chop allowed the user to separate their body parts, utilizing them to dodge swords, deal close range attacks, and fly.",
      "trivia": [
        "Although Chop's passive function was to avoid damage from sword slashes, Chop could also avoid swords that can create fire, freeze, cause electric shock, and even magic damage.",
        "Chop was mostly known because of its sword immunity.",
        "It was recommended to become a sword main instead of a fruit user when using Chop.",
        "Most attacks looked weird with R15 and layered clothing since the user's body stretched and did not disconnect.",
        "Chop was a very good replacement for elemental fruits to use at a low level since most enemies use swords in the First Sea, although it got bad quickly, getting outclassed in every way by higher rarity fruits because of its lack of abilities, and the fact that later NPCs (Second Sea and Third Sea) more commonly use Fighting Styles.",
        "Chop's X move was similar to Shark Saw's [X] move.",
        "Bobby, a Lv. 55 Boss, used Chop before Update 26.",
        "Chop and Rocket were the only fruits in which the [F] move has the highest mastery requirements out of all the other move.",
        "Chop is one of the only fruits whose reworks completely removed it from the game as Bobby/Chef no longer uses it."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Chop"
    },
    {
      "name": "Spring",
      "rarity": "Common",
      "type": "Natural",
      "price_money": 60000,
      "price_robux": 180,
      "description": "Enables high jumps and spring-based moves. Abilities: Knock, Spring Snipe, Spring Cannon, Spring Leap, Spring Emperor.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/8/8a/Spring_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027120418",
      "id": "spring",
      "wiki_description": "Enables high jumps and spring-based moves. Abilities: Knock, Spring Snipe, Spring Cannon, Spring Leap, Spring Emperor.",
      "page_description": "Spring is a Common Natural-type Blox Fruit that costs   60,000 or   180 from the Blox Fruit Dealer.",
      "trivia": [
        "Spring is used by the Lv. 850 Boss, Jeremy.",
        "There was a glitch with Spring’s [F] Spring Leap ability when, if it leaps into a chair in under one second, it allows the ability to continue forever if the user doesn’t move.\nThis glitch is now patched.",
        "This glitch is now patched.",
        "Spring has the potential to have possibly the worst [V] move in the game.",
        "Similarly to Awakened Buddha's [V] move, Spring's [V] Spring Emperor can deal very high damage if used in an enclosed space.",
        "Spring's [F] Spring Leap can go fast if it bounces off the sides of Second Sea's Bridge and can go faster than Light's [F]."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Spring"
    },
    {
      "name": "Bomb",
      "rarity": "Common",
      "type": "Natural",
      "price_money": 80000,
      "price_robux": 220,
      "description": "Allows creation of explosives. Abilities: Targeted Bomb, Explosive Jump, Bomb Grab, Land Mines, Self Destruct.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/4/43/Bomb_Fruit.png/revision/latest/scale-to-width-down/268?cb=20240304195914",
      "id": "bomb",
      "wiki_description": "Allows creation of explosives. Abilities: Targeted Bomb, Explosive Jump, Bomb Grab, Land Mines, Self Destruct.",
      "page_description": "Bomb is a Common Natural-type Blox Fruit that costs   80,000 or   220 from the Blox Fruit Dealer.",
      "trivia": [
        "Bomb was known as the cheapest fruit before Update 17.3, along with Spike as the second cheapest.",
        "Before Update 17.3, Bomb only had two moves, which were [Z] Snipe and [X] Ultimate Explosion.",
        "Bomb's [C] Land Mines move is said to be the [C] move that deals the highest damage in the game (if all landmines are totaled when held). Although, it is almost impossible for the enemy to hit all landmines in PvP.\nHowever, the player could use Shark Anchor's [Z] Move to make the opponent spin around and result in them exploding on multiple landmines.",
        "However, the player could use Shark Anchor's [Z] Move to make the opponent spin around and result in them exploding on multiple landmines.",
        "The old version of Bomb is used by the boss Stone along with the enemies Sorcerer, and Factory Staff.",
        "Bomb's [V] Self Destruct currently has the highest knockback in the entire game.\nThis move is also the only move in the entire game to drain the user's HP.",
        "This move is also the only move in the entire game to drain the user's HP.",
        "Bomb's [X] Bomb Grab is very similar to Superhuman's [C] move, with the same sound effect and animation when dashing forward."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Bomb"
    },
    {
      "name": "Smoke",
      "rarity": "Common",
      "type": "Elemental",
      "price_money": 100000,
      "price_robux": 250,
      "description": "Grants smoke manipulation for flight and logia immunity. Abilities: Smoke Slam, Smoke Bomber, Smoke Blast, Smoke Liberation.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/7/7e/Smoke_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027120224",
      "id": "smoke",
      "wiki_description": "Grants smoke manipulation for flight and logia immunity. Abilities: Smoke Slam, Smoke Bomber, Smoke Blast, Smoke Liberation.",
      "page_description": "Smoke is a Common Elemental-type Blox Fruit that costs   100,000 or   250 from the Blox Fruit Dealer.",
      "trivia": [
        "Out of all fruits in the game, Smoke has the lowest mastery requirements to unlock all of its moves.",
        "Smoke is currently the cheapest Elemental-type fruit.",
        "Since the duration of [F] Smoke Bomber is infinite and the user can attack while flying, it is considered the best grinding move in Smoke's moveset.",
        "Smoke is one of three Elemental-type Blox Fruits without an Awakening, the second being Blizzard, and the third being Gas.",
        "Smoke is the only Common Elemental-type Blox Fruit.",
        "Smoke is good for Sea Beast hunting due to the fact that every move can hit them.",
        "The sound that plays during elemental immunity is the same as the Gas fruit.",
        "NPCs cannot leave the AoE of [X] Smoke Blast until it ends."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Smoke"
    },
    {
      "name": "Spike",
      "rarity": "Common",
      "type": "Natural",
      "price_money": 180000,
      "price_robux": 380,
      "description": "Creates spikes for attacks. Abilities: Spike Summon, Whirlwind, Spiky Ball, Spike Barrage.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/c/ce/Spike_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027120251",
      "id": "spike",
      "wiki_description": "Creates spikes for attacks. Abilities: Spike Summon, Whirlwind, Spiky Ball, Spike Barrage.",
      "page_description": "Spike is a Common Natural-type Blox Fruit that costs   180,000 or   380 from the Blox Fruit Dealer.",
      "trivia": [
        "Spike is infamously known as the \"Walmart Dough\" because of its moves being similar to awakened Dough, specifically [X] (on ground) and [F] moves that compare to Spike's [Z] and [C] moves.",
        "Spike used to always be in stock, along with Bomb, but this was changed when Rocket and Spin became the new two cheapest fruits.\nBefore Update 17.3, Spike had only two moves, which were [Z] Rush and [X] Spiky Ball.",
        "Before Update 17.3, Spike had only two moves, which were [Z] Rush and [X] Spiky Ball.",
        "The Factory Staff and Sorcerer use old Spike's [X] Spiky Ball.",
        "Spike is currently the most expensive Common Fruit.",
        "Spike is one of the only fruits without a transformation whose [C] move has longer cooldown and higher energy requirement than the [V] move.",
        "Spike is the only Common fruit without a [F] move.",
        "If aimed correctly, and if lucky, the enemy can get hit by more than one spike from Spike's [Z] and [V] moves.\nEnemies with bigger hitbox have a higher chance to get hit by multiple spikes. (e.g. Buddha)",
        "Enemies with bigger hitbox have a higher chance to get hit by multiple spikes. (e.g. Buddha)",
        "Spike's [X] Whirlwind move's hitbox seems to only have a horizontal reach represented by the spinning hands, but it actually resembles more of a \"square\". This is supported by the fact that, if a NPC is lured under a tree, and the user uses this move while being on the tree, fully holding this move will reach and hit the NPC.",
        "During the [C] Spiky Ball move, the user is able to jump. However, they cannot use neither double jump or Air Jump.",
        "There is a bug that sometimes when the [C] Spiky Ball gets canceled, the rolling animation will play, and the user will \"roll\" forward as if they executed the actual attack. During this, the user is able to freely use all other abilities, and the effects of the bug will last for only 3 seconds.",
        "There was a bug that when a physical Spike was held, its eyes were behind the model, not in front where they were supposed to be."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Spike"
    },
    {
      "name": "Flame",
      "rarity": "Uncommon",
      "type": "Elemental",
      "price_money": 250000,
      "price_robux": 550,
      "description": "Fire-based projectiles and flight; awakenable for 14,500 Fragments. Awakened abilities include Blue Fire Bullets, Rocket Flight, etc.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/c/c4/Flame_Fruit.png/revision/latest/scale-to-width-down/268?cb=20250421150742",
      "id": "flame",
      "wiki_description": "Fire-based projectiles and flight; awakenable for 14,500 Fragments. Awakened abilities include Blue Fire Bullets, Rocket Flight, etc.",
      "page_description": "Flame is an Uncommon Elemental-type Blox Fruit that costs   250,000 or   550 from the Blox Fruit Dealer.",
      "trivia": [
        "Flame fruit is used as the symbol in the Blox Fruits game logo.",
        "The awakened [V] move shares its name with the ultimate fire spell from Elemental Battlegrounds (a game developed by Gamer Robot). The difference is that Elemental Battleground's spell Hell's Core creates an explosion around the user, unlike the move seen in Blox Fruits, which is a launchable fire bomb.",
        "Flame, along with Ice and Quake, were the first fruits which received an awakening.",
        "The awakened [Z] move has been reworked twice.",
        "Flames unawakened [X] has been reworked 3 times.",
        "Despite having control over fire, the user does not have immunity to lava which can be found at the Magma Village, Flame and Magma Raids, and the hot side of Hot and Cold.",
        "Flame is currently the cheapest fruit to have an awakening.",
        "Pre-rework awakened [Z] move used to have a visual glitch, where even if it seemed like it had disappeared (due to not hitting), it was still moving, invisibly. (The projectile would still hit despite it seeming like it had vanished.)",
        "Before the rework, Flame's [V] move did not have the ability to charge up and deal more damage, it would just take around one second before being able to cast it.",
        "Flames [V] move used to spin before it got reworked.",
        "Flames [Z] move shares the same effect with Ice’s [Z] move, Ice Spears, but has different colors.",
        "Flame’s [X] Move is weaker awakened if all tick damage is avoided. Barely hitting the enemy can cause this to happen.",
        "Flame’s awakened [X] Move can be bugged to knockback NPCs even if it doesn’t hit. This is due to the way the script is made and thus still deals damage and knockback, just no effects.",
        "Flame is currently the cheapest Uncommon fruit in the game.",
        "Flame's [V] move had a bug where before the rework in update 17. It used to disappear and move similar to Rumble's [V] move, giving it bad range.",
        "Flame's [Z] move before getting reworked used to have burn effect. However, the projectile would have a glitchy hitbox and may not register the hit.",
        "Flame's [X] move before the rework had a bug where if it hit a player would make a explosion but the beam kept moving and expanding. Then made a 2nd explosion before ending.",
        "Players can find Flame fruit meshes of the explosions during update 17.3 called firewind. They are still existing in the Roblox studio catalog.",
        "Pre-rework awakened [Z] used to grow in size as it traveled, and would cast a bigger burning area when hit.",
        "flame fruit along with dragon are the only confirmed fruits to use free models before being reworked."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Flame"
    },
    {
      "name": "Falcon",
      "rarity": "Uncommon",
      "type": "Beast",
      "price_money": 300000,
      "price_robux": 650,
      "description": "Bird transformation for flight. Abilities: Plumage, Wind Burst, Flight, Bone Crusher, Soaring Talons.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/e/ef/Falcon_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027115527",
      "id": "falcon",
      "wiki_description": "Bird transformation for flight. Abilities: Plumage, Wind Burst, Flight, Bone Crusher, Soaring Talons.",
      "page_description": "Falcon (formerly known as Bird: Falcon) was an Uncommon Beast-type Blox Fruit that used to cost   300,000 or   650 from the Blox Fruit Dealer.",
      "trivia": [
        "Falcon was one of two Blox Fruits to have \"Bird:\" in their name, along Phoenix.",
        "Falcon was the only Uncommon Beast-type fruit.",
        "Falcon was the cheapest Beast Blox Fruit in money and value.",
        "If the player used [Z] Plumage and switches to another Blox Fruit, they would keep Falcon's wings, along with the buffs.\nThe player would lose these wings when they died, switched teams, or left the game.",
        "The player would lose these wings when they died, switched teams, or left the game.",
        "Falcon was sometimes considered half-beast by the community, as it did not have a full transformation.\nThis was slightly justified, as it could see some use in most cases, though its moves were not very powerful by most measures.",
        "This was slightly justified, as it could see some use in most cases, though its moves were not very powerful by most measures."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Falcon"
    },
    {
      "name": "Ice",
      "rarity": "Uncommon",
      "type": "Elemental",
      "price_money": 350000,
      "price_robux": 750,
      "description": "Ice attacks and freezing; walk on water; awakenable for 14,500 Fragments.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/c/c5/Ice_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027115604",
      "id": "ice",
      "wiki_description": "Ice attacks and freezing; walk on water; awakenable for 14,500 Fragments.",
      "page_description": "Ice is an Uncommon Elemental-type Blox Fruit that costs   350,000 or   750 from the Blox Fruit Dealer.",
      "trivia": [
        "[Z] Ice Spears used to be the Awakened [Z] move before it got reworked.",
        "The user can wall run on an inclined walls by holding down [F] Ice Skating, and will run faster than usual if they try running straight on them.",
        "[Z] Cold Storm is similar to Blizzard’s [X] White Out but slower.",
        "It is possible to glitch through thin walls (for example: Mansion or Café walls) with [F] Ice Skating.",
        "[C] Ice Bird is better than [C] Frozen Dragon for combos.",
        "The player can use Flash Step onto the trail of ice on water.",
        "Some skins can cause the trail of ice on water to be generated more slowly as players run.",
        "[V] Absolute Zero shares the same name with the Aura Skin, Absolute Zero.",
        "Ice and Light are the only fruits that have a unique weapon that can be used when equipped (Gas and Blade could be considered yet another one with a weapon of its own, just not visible to the naked eye).",
        "[C] Frozen Dragon's stun time depends on how far the enemy is (i.e. the further the enemy is from the user, the longer the stun).",
        "Ice shares the Frost Walker passive with Yeti, with both having the same purpose and similar path models.",
        "Sometimes, [V] Absolute Zero can make the animation in air, but the AoE does not appear in the floor.",
        "Ice’s Elemental Reflex sound is the same as Blizzard's."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Ice"
    },
    {
      "name": "Sand",
      "rarity": "Uncommon",
      "type": "Elemental",
      "price_money": 420000,
      "price_robux": 850,
      "description": "Sand manipulation; awakenable for 14,500 Fragments; double damage in water.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/7/72/Sand_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027120103",
      "id": "sand",
      "wiki_description": "Sand manipulation; awakenable for 14,500 Fragments; double damage in water.",
      "page_description": "Sand is an Uncommon Elemental-type Blox Fruit which allows the player control over sand and costs   420,000 or   850 from the Blox Fruit Dealer.",
      "trivia": [
        "Sand is the one of the only Blox Fruits that has a passive which gives a disadvantage to the user in the game, along with Control.",
        "Awakened Sand's [F] move shares the same name as Blizzard's [F] move - Tornado Flight.",
        "The [Z] and [X] move's (both awakened and unawakened) range increases depending on the mastery.",
        "Sand currently has the slowest flight in the game."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Sand"
    },
    {
      "name": "Dark",
      "rarity": "Uncommon",
      "type": "Elemental",
      "price_money": 500000,
      "price_robux": 950,
      "description": "Dark energy attacks; awakenable for 14,500 Fragments.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/5/5c/Dark_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027115358",
      "id": "dark",
      "wiki_description": "Dark energy attacks; awakenable for 14,500 Fragments.",
      "page_description": "Dark is an Uncommon Elemental-type Blox Fruit that costs   500,000 or   950 from the Blox Fruit Dealer.",
      "trivia": [
        "Dark is not great for aerial combat (unawakened), thus Angel race would be an effective counter.",
        "The Dark raid NPCs have low damage but the player will have a high chance of death if they get stuck in a Dark user's Black Hole move, since it keeps them in place and allows the rest of the Raid NPCs to attack them freely. It is recommended to have a Buddha user.",
        "To the average eye, there is only one mobility move. However, skilled players can take advantage of another potential mobility move, which is the awakened [Z] move, Dimensional Slash. In a fight, the user can confuse enemies by using Dimensional Slash on an NPC to quickly teleport away.",
        "Dark's [X] Black Spiral move instantaneously teleports to its maximum range when it is aimed at an open space in the air. It is especially dangerous when using shift-lock (whose default direction is forward) during aerial combat.",
        "[F] Ghastly Step has a much shorter range than Flash Step though can be used in the air.",
        "There is a glitch involving Dark [C] not allowing itself to hit Buddha users. This could be most likely due to the confusing hitbox of Buddha. To deal with this, aim it at the body of the Buddha user as that is where the main hitbox mainly is located.",
        "The old version of Dark is used by the Raid Boss, Darkbeard, the Dark Raid NPCs (Darkness/Dark users), the Possessed Mummy NPCs and the Elite Pirate, Diablo (the awakened version), as well as the NPCs and Boss in the Hell Dimension in the Cursed Dual Katana Puzzle.",
        "The Dark users in the Dark Raid are not called Dark Users, instead they are called Darkness Users.",
        "Pre-rework unawakened [V] used to have a bigger explosion.",
        "Awakened Dark [Z] Dimensional Slash have same sound effects with Dark Blade [X] Dark Air Slash.",
        "There's a bug where if the user uses Unawakened [Z] Dark Rocks and unequips/switches to another item in their hotbar after releasing the move, they'll be able to move around while throwing the rocks."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Dark"
    },
    {
      "name": "Diamond",
      "rarity": "Uncommon",
      "type": "Natural",
      "price_money": 600000,
      "price_robux": 1000,
      "description": "Diamond hardening for defense and attacks.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/8/88/Diamond_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027115405",
      "id": "diamond",
      "wiki_description": "Diamond hardening for defense and attacks.",
      "page_description": "Diamond is an Uncommon Natural-type Blox Fruit that costs   600,000 or   1,000 from the Blox Fruit Dealer.",
      "trivia": [
        "[TAP] Radiant Lunge is similar to an old move prior to the revamp, Beaming Tackle. Similarly, the revamped [X] Shard Storm is a rework of Diamond Hail, and [C] Shimmering Disruption is the newer Solar Flare.",
        "The [Z] Encrust move, when used against a wall or corner, will deal around 3.5x more damage.",
        "Diamond is one of the few fruits in the game that can actively distort enemies. Others are Gravity, Quake and Venom.",
        "Diamond has one of the largest differences between its physical model and its fruit icon (both the face, stem, and overall shape).",
        "Diamond is one of the two Uncommon fruits that is not Elemental and does not have an awakening.",
        "Diamond is the only Natural Uncommon Blox Fruit.",
        "Diamond is one of the only non-beast type fruits that can transform, the others being Rubber, Venom and Gas.",
        "For some reason, if the user's character does not have skin, [Z] Encrust will not turn their character blue.\nThis may be because the new Diamond changes the color of the user's skin, like Rubber, instead of coating their avatar with a diamond texture, which was the old Diamond.",
        "This may be because the new Diamond changes the color of the user's skin, like Rubber, instead of coating their avatar with a diamond texture, which was the old Diamond.",
        "There's a glitch that can make the user avatar fling very far by using the [TAP] ability while using a certain Roblox avatar. This can also be done by jump-dashing and tapping if you have a weak device with high ping.",
        "The eyes of the fruit in inventory are different from physical model."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Diamond"
    },
    {
      "name": "Light",
      "rarity": "Rare",
      "type": "Elemental",
      "price_money": 650000,
      "price_robux": 1100,
      "description": "Light-based speed and attacks; awakenable for 14,500 Fragments.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/8/83/Light_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027115623",
      "id": "light",
      "wiki_description": "Light-based speed and attacks; awakenable for 14,500 Fragments.",
      "page_description": "Light is a Rare Elemental-type Blox Fruit that costs   650,000 or   1,100 from the Blox Fruit Dealer.",
      "trivia": [
        "The light spear was extremely glitchy the first time it was updated. For instance, running against a low wall like the one in Jungle can make the user fall down while their character glitches. This was fixed a few hours or days later, during the Christmas Event.",
        "In the first few updates, Light's sword (which is now a spear) used to be a separate item instead of being within the fruit.",
        "Awakened Light has the second fastest flight speed in the game if the user is at full Health, behind Western Dragon.",
        "Unawakened Light's flight move is uncontrollable and only flies straight. Fortunately, the awakened version can be controlled but can only make ~45 degree turns.",
        "When flying with Light, if the user collides with any solid object, the user will bounce off it. This is because of the properties of light in real life, which make it bounce off of surfaces. This is also known as specular reflection.",
        "If the player were using [C] Lightspeed Destroyer and get teleported (like during trials) or opponent out the server, the player will transform into a star (literally). The user still can use their abilities, but in the appearance of a star.",
        "Light can be more effective in AFK grinding than Magma due to the light spear. Since the user can use an auto-clicker with it, Ice also works in this case.",
        "Strangely, [V] Sky Beam Barrage is better in the matter that it breaks Instinct, though it lacks in the large AoE that the Awakened version has. The start-up lag of the unawakened version is also more noticeable like Lightning's [C] move.",
        "[C] Lightspeed Destroyer, acts somewhat similarly to Portal's [Z] Portal Dash, as both moves involve the player teleporting to the enemy, dealing damage by kicking the target around, and smashing them down to the ground.",
        "[X] Barrage of Light is very similar to Dragon's [C] Scorching Downfall.",
        "Although Portal [C] World Warp is faster than [F] Shining Flight, [F] Shining Flight is good for getting to specific places on islands, like the top of the Great Tree, rather than the default spawn point of that island.",
        "Despite light realistically having no stationary mass, Light Ray is able to knock targets into midair.",
        "Due to a bug, Elemental Reflex doesn’t function at random times for an extended period, although this is extremely rare.",
        "In the early days of Blox Fruits's development, the [V] move used to be the flight move instead of the [F], which was changed for release.",
        "There is a bug with [C] Lightspeed Destroyer move in which it makes the user's accessory invisible (ex. Holiday Cloak, Kitsune Ribbon etc.)",
        "The Light Raid's final island has a structure that is also used in Elemental Battlegrounds' light map. (a game also made by Gamer Robot)",
        "If the user lands [C] Lightspeed Destroyer at high attitude, the enemy will fall more slowly than at low or on land because there's no ground for the final hit (which makes lag and screenshake). This makes it easier to combo but also does less damage.",
        "Rarely, in some servers, if players use [X] Hand of the Emperor on ground, it will leave a permanent dust effect where it passed. This can make lag when looked.",
        "Due to a bug, if the player commences a friendly match in colosseum or friendly arena and lose the match, the light spear will disappear. To get it back, the player needs to reset character (respawn)."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Light"
    },
    {
      "name": "Rubber",
      "rarity": "Rare",
      "type": "Natural",
      "price_money": 750000,
      "price_robux": 1200,
      "description": "Rubber body granting immunity to guns and electric attacks.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/5/5c/Rubber_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027120046",
      "id": "rubber",
      "wiki_description": "Rubber body granting immunity to guns and electric attacks.",
      "page_description": "Rubber is a Rare Natural-type Blox Fruit that costs   750,000 or   1,200 from the Blox Fruit Dealer.",
      "trivia": [
        "Rubber is the only fruit having a resistance against three attack types. (Fruits, Guns and Fighting Styles)",
        "Previously, Pole (1st Form) could not damage Rubber, which may have been a bug as it was changed in Update 20.",
        "Rubber [F] is the highest impulse dash move in the game.",
        "If used properly, the [F] move can be faster than Dragon's [F] at the start.",
        "Rubber is one of the Blox Fruits to have gotten a rework in Update 17.3.",
        "Rubber used to only cost   100,000, however, it now costs   750,000. (Maybe due to its Transformation buff)",
        "Rubber was originally named Gum.\nRubber used to have a move called \"Gum Rocket\" which would function as a great mobility tool. This was replaced with \"Transformation\".\nSome of Rubber's old moves used to be able to pick up physical fruit when dropped on the ground.",
        "Rubber used to have a move called \"Gum Rocket\" which would function as a great mobility tool. This was replaced with \"Transformation\".",
        "Some of Rubber's old moves used to be able to pick up physical fruit when dropped on the ground.",
        "Despite being immune to Lightning, Rubber does not provide immunity to the attacks used by the Thunder God, due to him being a boss.",
        "If Rubber's M1 attack is held while in the air and released while the user's mouse is on a menu button, they'll be able to stay in the air for a long time and then fall down.",
        "Permanent Rubber costs the same amount of Robux   as Dark Blade.",
        "If the player holds  or tap Cursed Dual Katana's [X] move, then quickly switch to [X] or [C] move of the Rubber Fruit when it is released, the transformed variant of the [X]/[C] move will be used, regardless of whether the player is in their transformed state.",
        "The [Z] skill has the same name as the Phoenix unawakened [Z] move.",
        "Rubber is the first ever fruit to have a M1 outside of a transformed or unawakened state.",
        "Rubber M1, Z, X, and C changes color depending on the user's aura color, similar to Spider's V move (Heavenly Punishment).",
        "Rubber is the only fruit to only have an M1 before unlocking an actual move, make this is the only fruit with a [Z] move mastery requirement of over 1.",
        "Rubber is the first fruit to be a non-beast type fruit with a transformation, followed by Diamond and Venom in second, and Gas in third.",
        "Rubber is based on the Gum-Gum fruit from One piece"
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Rubber"
    },
    {
      "name": "Barrier",
      "rarity": "Rare",
      "type": "Natural",
      "price_money": 800000,
      "price_robux": 1250,
      "description": "Creates barriers for protection.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/1/19/Barrier_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027115304",
      "id": "barrier",
      "wiki_description": "Creates barriers for protection.",
      "page_description": "Barrier was a Rare Natural-type Blox Fruit that used to cost   800,000 or   1,250 from the Blox Fruit Dealer.",
      "trivia": [
        "Previously, Barrier was the only fruit capable of changing color cycling between green and blue repeatedly."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Barrier"
    },
    {
      "name": "Ghost",
      "rarity": "Rare",
      "type": "Natural",
      "price_money": 940000,
      "price_robux": 1275,
      "description": "Revival and ghost form abilities.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/8/8c/Ghost_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027115804",
      "id": "ghost",
      "wiki_description": "Revival and ghost form abilities.",
      "page_description": "Ghost (formerly known as Revive) is a Rare Natural-type Blox Fruit that costs   940,000 or   1,275 from the Blox Fruit Dealer.",
      "trivia": [
        "Ghost is the third fruit to have a change in rarity, the first being Portal, the second being Love and the fourth being Creation.",
        "The resurrection effect will last forever even if the user switches to another fruit. It only disappears when they die or exit the game. Also, the green effect can affect transformed fruits or moves like unawakened Dough's [F] move.",
        "If the user dies by Water, the resurrection passive will not work.",
        "[V] Ghost Busters does not stack damage from skills, but it does increase the hitbox.",
        "[V] Ghost Busters masters up the fighting style or sword of the user no matter what they are using.",
        "The ghosts in [V] Ghost Busters can sometimes be named \"Elf\". (Exclusive to Christmas Updates)",
        "[C] Cries of the Underworld is similar to Sound's [X] Fortissimo but holdable.",
        "[V] Ghost Busters can hit Ice Admiral with its moves.",
        "Permanent Ghost's icon when stored in the inventory uses Revive's icon.",
        "As of Update 26, when Ghost is equipped, the (slightly modified) Revive icon will be shown instead of the new icon."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Ghost"
    },
    {
      "name": "Magma",
      "rarity": "Rare",
      "type": "Elemental",
      "price_money": 960000,
      "price_robux": 1300,
      "description": "Magma attacks with high damage; walk on water; awakenable.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/2/27/Magma_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027115640",
      "id": "magma",
      "wiki_description": "Magma attacks with high damage; walk on water; awakenable.",
      "page_description": "Magma is a Rare Elemental-type Blox Fruit that costs   960,000 or   1,300 from the Blox Fruit Dealer.",
      "trivia": [
        "The reworked, unawakened version of Magma was created by Kio, also known as @LegendOfKio on X, a contributor who played an important role in remaking the entire fruit in Update 17.3.",
        "If a boat collides with a magma puddle, it will immediately stop. If the player using Magma stands close to the boat, it'll move the player as well.",
        "Magma is known to be one of the highest damage-dealing fruits in the game, when ignoring moves that require all or infinite damage.",
        "The Magma Admiral and the Lava Pirates use the old unawakened version of Magma, both using only the [Z] (Magma Fist) and [X] (Magma Column) move. The Elite Pirate, Deandre, also uses the new awakened version of Magma.",
        "Awakened Magma's [F] Beast Ride move has the same sound effect as a Sea Beast when spawning or deadly roar skill.",
        "Magma used to take no energy when walking on water but this has since been changed.",
        "Air Jumping and aiming [X] Volcanic Assault at the opponent from above removes knockback from the move, which can be useful to start a combo.",
        "If lucky, and if aimed properly, Awakened Magma's [Z] Magma Shower move can do almost as much damage as the awakened [V] Volcanic Storm move.",
        "[Z] Magma Shower has an incredible range, as the projectiles do not despawn even at 2500+ meters.",
        "For some reason, Magma puddles reappear and disappear faster when the player is holding a move.",
        "If the user uses Awakened Magma's [F] Beast Ride, jump, and then switch to another item after that (e.g. a fighting style) they will be flung very far. Although this is a glitch, it can be very useful while hunting Sea Beasts and Terrorsharks as it allows the player to sky camp above them and use the effect of gravity on their moves to kill them while taking minimal to no damage. The direction you go depends on your mouse (PC). Not switching to another weapon/item will make you still go fling, but less distance. To go up, simply look up. putting your mouse right at your avatar doesn't work.",
        "If a player holds a Magma fruit for about a second, and unequips it (not dropping), and then re-equips it in a different area, a singular magma droplet (from the special effect of the physical fruit) will appear in the area where the fruit previously was.",
        "Sometimes Magma's [V] Volcanic Storm glitches, causing the attack to stay in held form."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Magma"
    },
    {
      "name": "Quake",
      "rarity": "Legendary",
      "type": "Natural",
      "price_money": 1000000,
      "price_robux": 1500,
      "description": "Earthquake waves; awakenable.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/4/42/Quake_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027115754",
      "id": "quake",
      "wiki_description": "Earthquake waves; awakenable.",
      "page_description": "Quake is a Legendary Natural-type Blox Fruit that costs   1,000,000 or   1,500 from the Blox Fruit Dealer.",
      "trivia": [
        "Quake's [V] move has the largest AoE in the game.\nThis move can be used to grind efficiently many enemies at once in large areas such as the Cursed Ship or the Haunted Castle.",
        "This move can be used to grind efficiently many enemies at once in large areas such as the Cursed Ship or the Haunted Castle.",
        "The old and unawakened version of Quake is used by Greybeard.",
        "Quake is good for raids because of the [V] move that deals massive damage and has a large AoE on both awakened and unawakened. It also has two skills that can stun the boss (if awakened).",
        "Although Quake's awakened [V] Seaquake has two extra tsunamis, they do less damage than Quake's unawakened [V] Dual Tsunami. Seaquake does extra damage and stuns with the ground smash.",
        "Quake is the only awakened fruit with only four moves instead of five, due to the fruit's lack of the [F] move, mainly known to be a method of mobility. It is also the only legendary fruit to not have a [F] move.",
        "Quake is the most common Legendary fruit due to it being the cheapest of its rarity. As such this fruit is commonly used to buy Phoenix and Dough raids and given to Trevor to gain access to Don Swan's room.",
        "Quake is the first Legendary fruit to have an awakening.",
        "Quake has unique fragment costs due to it only having four moves when fully awakened.",
        "This is the third most expensive fruit to awaken. Additionally, its [V] Seaquake is the most expensive move to awaken.",
        "Quake is one of the only fruits to get its icon changed.",
        "Quake's unawakened [V] move has a glitch when used in raids since frequently, it can move very slow and despawn not dealing any damage or sometimes even submerge below the ground/water."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Quake"
    },
    {
      "name": "Buddha",
      "rarity": "Legendary",
      "type": "Beast",
      "price_money": 1200000,
      "price_robux": 1650,
      "description": "Giant form with damage reduction; awakenable.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/d/df/Buddha_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027115325",
      "id": "buddha",
      "wiki_description": "Giant form with damage reduction; awakenable.",
      "page_description": "Buddha (formerly known as \"Human: Buddha\") is a Legendary Beast-type Blox Fruit that costs   1,200,000 or   1,650 from the Blox Fruit Dealer.",
      "trivia": [
        "Rabbit does add speed, but the difference is less when transformed. This is because Rabbit's buffs for Buddha got nerfed.\nAccessories provide speed boosts normally.\nPilot Helmet and Rabbit V2 will allow the user to move at a moderate speed, and the Agility (V3 ability) can help if the player is not in Third Sea.",
        "Accessories provide speed boosts normally.",
        "Pilot Helmet and Rabbit V2 will allow the user to move at a moderate speed, and the Agility (V3 ability) can help if the player is not in Third Sea.",
        "Draco's V2 flight ability and Flash Step is significantly buffed while in Buddha form, letting the user fly much higher and their Flash Step having much larger AoE.",
        "Buddha's unawakened total damage reduction when stacked with full body Aura of 54%, while the awakened form has 61%.\nUsing Shark V3 while wearing the Leviathan Shield will make the user's defense (against Melee/Sword/Gun attacks) up to 90%, or 79.14% by using Cyborg V3.\nSound's Tempo Meter can also add additional defense and extra speed.",
        "Using Shark V3 while wearing the Leviathan Shield will make the user's defense (against Melee/Sword/Gun attacks) up to 90%, or 79.14% by using Cyborg V3.",
        "Sound's Tempo Meter can also add additional defense and extra speed.",
        "Unawakened Buddha moves can be used while in awakened form, however, awakened moves cannot be used in unawakened form.",
        "The [Z] move is the only move necessary for the defense and range buff, so instead of getting full mastery, it is recommended to just get the first move.",
        "Players at the middle of the awakened [C] move's explosion (direct hit) will take around 2x more damage than players around the explosion.",
        "Although the awakened moves of Buddha have large AoE, damage, and stuns, most people only awaken the [Z] move and rarely the [F] move for the damage reduction and slight mobility.",
        "Buddha is a great choice to grind with, but Elemental fruits are far better choices in First Sea due to them being easier to obtain."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Buddha"
    },
    {
      "name": "Love",
      "rarity": "Legendary",
      "type": "Natural",
      "price_money": 1300000,
      "price_robux": 1700,
      "description": "Love-themed attacks; awakenable.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/b/b3/Love_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027115630",
      "id": "love",
      "wiki_description": "Love-themed attacks; awakenable.",
      "page_description": "Love is a Legendary Natural-type Blox Fruit that costs   1,300,000 or   1,700 from the Blox Fruit Dealer.",
      "trivia": [
        "Love previously was not very rare but had exceptionally high combo potential if used correctly.",
        "Love is one of the few fruits that have abilities that resemble Transformation. While the user doesn't technically \"transform\" into the respective thing the fruit is named after, the [F] Flamingo Ride ability disables all weapons except for the fruit, similar to many other transformations. The other fruit that can \"transform\" is Ghost.\nWhile Ghost indeed does transform into the respective thing, the transformation is only triggered by death, as the [V] move doesn't really count.",
        "While Ghost indeed does transform into the respective thing, the transformation is only triggered by death, as the [V] move doesn't really count.",
        "Love's [X] move had the longest range in the game (even more than Pain) if the user aimed it correctly at another player's body (this did not apply to NPCs). Unfortunately, this was patched in Update 24.",
        "Love is widely considered to be one of the most annoying and difficult fruits to fight against, mainly due to its Lovestruck passive, high range, and skycamping capabilities.",
        "The NPC spawned from [V] Besto Friendo can sometimes trick exploit scripts and make exploiters follow the NPC in an attempt to kill it but won't deal any damage if their PvP is off, effectively rendering the script useless, unless the exploiter is online while farming, but it is very unlikely.",
        "If the user has spawned a Friend from Love's [V] Besto Friendo and dies, the Friend will die as well.",
        "The Friend's health and damage scale off the user's current level. Their health is user's level multiplied by 2, and their M1 damage is user's level divided by roughly 1.65 (ex. user's level is 2650, so the Friend's health will be 5300 HP, and their M1 will deal around 1609 damage.)",
        "Love's [X] and [C] move can only be held for 7.5 seconds.",
        "There's a bug/glitch where, if the user uses Love's [F] Flamingo Ride move and has console mode active, the user is able to use their Fighting Style, Sword, and Gun while riding on the flamingo. This is most likely patched.",
        "Love's flight ability is one of the only fruits that allows the player to stop moving in mid-air and heal naturally while in flight. The other fruits that can do this are Eagle, Phoenix, Gravity and Dragon.",
        "Love's [F] Flamingo Ride previously was able to fly in boats.",
        "The former Lv. 1675 boss (Island Empress) used the Z, X, and V moves of old Love fruit.",
        "There is a glitch/bug that allows more than four players in the same raid at a time by using Love's [F] Flamingo Ride and having an allied player on the flamingo and both in the raid tube at the same time. However, mounted players cannot deal damage in raids, and they don't get rewards. This can also be done with Kitsune, by having an allied player mount on the Kitsune user while transformed.",
        "Love is the only fruit that uses an In-game friend's Avatar.",
        "There is a glitch where if someone uses Love's [V] move, Besto Friendo, perfectly on a chair like in Mansion or Café (the ones utilized for Trading), other players will not be able to sit on that chair for the rest of the duration of the server.\nThis can be used for trolling people, by using Besto Friendo on a chair on each pair of chairs, making trading impossible.",
        "This can be used for trolling people, by using Besto Friendo on a chair on each pair of chairs, making trading impossible.",
        "The flamingo on the [F] move wears the Heart Shades accessory.",
        "This is the first ever fruit to be able to carry other players (on the flamingo)."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Love"
    },
    {
      "name": "Spider",
      "rarity": "Legendary",
      "type": "Natural",
      "price_money": 1500000,
      "price_robux": 1800,
      "description": "String manipulation; awakenable.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/6/61/Spider_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027120241",
      "id": "spider",
      "wiki_description": "String manipulation; awakenable.",
      "page_description": "Spider (formerly known as String) is a Legendary Natural-type Blox Fruit that costs   1,500,000 or   1,800 from the Blox Fruit Dealer.",
      "trivia": [
        "Spider is used by Swan and Don Swan.\nSwan has a unique move, the move being Multi-directional Silk.\nWith that, Don Swan has another version aside from the awakened and unawakened version of Spider. However, this version is only available in the second stage. It is an improved Spider [V] and [X], the [V] is a triple version of the unawakened [V], tripling the range, AoE and damage in the process, and the [X] shoots more Multi-String Attacks in an X pattern. However, due to this version being only available to a boss, it is impossible to find out whether there are any other differences.",
        "Swan has a unique move, the move being Multi-directional Silk.",
        "With that, Don Swan has another version aside from the awakened and unawakened version of Spider. However, this version is only available in the second stage. It is an improved Spider [V] and [X], the [V] is a triple version of the unawakened [V], tripling the range, AoE and damage in the process, and the [X] shoots more Multi-String Attacks in an X pattern. However, due to this version being only available to a boss, it is impossible to find out whether there are any other differences.",
        "Despite it being called \"Spider\", it is not a Beast type fruit because it allows players to control strings rather than transform into a spider.",
        "Spider is the second fruit that has a Beast themed Natural type fruit, the first one being Venom.",
        "The current unawakened [F] Spider Path is actually the pre-rework awakened String's [F] Spider Highway.",
        "Every awakened move of Spider can be held to deal more damage, but that does not mean it can be held indefinitely.",
        "Many consider Spider's [C] Over-heated Sniper move to be better than the awakened version because of its range, Instinct break, and damage.",
        "Spider has the biggest fruit model.",
        "Spider's [Z] Spider Wraith uses the same sound effect as Cyborg V4's Energy Control Super Jump.",
        "Spider's [C] Over-heated Sniper has a longer lasting tripwire effect than Buddy Sword's [X] Lightning Wave.",
        "",
        "Formerly, the title awarded upon awakening at least one move of this fruit was \"The Joker\". People that awakened this fruit prior to the title change will still be able to use it, but it is no longer obtainable."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Spider"
    },
    {
      "name": "Sound",
      "rarity": "Legendary",
      "type": "Natural",
      "price_money": 1700000,
      "price_robux": 1900,
      "description": "Sound waves for attacks; awakenable.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/b/ba/Sound_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027120231",
      "id": "sound",
      "wiki_description": "Sound waves for attacks; awakenable.",
      "page_description": "Sound is a Legendary Natural-type Blox Fruit that costs   1,700,000 or   1,900 from the Blox Fruit Dealer.",
      "trivia": [
        "Sound is the first fan-made fruit to be added to the game. The original concept was created by @Aqu4G (on X/Twitter), one of the winners of the first fan fruit/art contest. The second is the Kitsune fruit.",
        "Many of Sound's moves contain musical vocabulary, such as Tempo (rate of speed of music played), Prestissimo (very fast) or Fortissimo (very loud).",
        "While using [F] Tempo: Prestissimo, the user can fly faster (or even faster with the Tempo Meter activated) when their health is low, but not as fast as Venom (it also has the same flight mechanic).",
        "Sound now allows for the newest, highest potential speed for a player in the game, by combining the following: Maximum Tempo Meter + Rabbit V4 (and Agility) + Pilot Helmet. However, this is still not the fastest transportation method, as Portal has the ability to instantly teleport to most islands in any sea.",
        "Sound is the second least expensive fruit to have a meter, but also a variable meter.\nSound is also one of the fruits that have meters that are not intended for transformation, with the others being Gravity, Shadow, Creation, and Spirit.",
        "Sound is also one of the fruits that have meters that are not intended for transformation, with the others being Gravity, Shadow, Creation, and Spirit."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Sound"
    },
    {
      "name": "Phoenix",
      "rarity": "Legendary",
      "type": "Beast",
      "price_money": 1800000,
      "price_robux": 2000,
      "description": "Phoenix transformation with regeneration; awakenable.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/f/fc/Phoenix_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027115733",
      "id": "phoenix",
      "wiki_description": "Phoenix transformation with regeneration; awakenable.",
      "page_description": "Phoenix (formerly known as Bird: Phoenix) is a Legendary Beast-type Blox Fruit that costs   1,800,000 or   2,000 from the Blox Fruit Dealer.",
      "trivia": [
        "Currently, Buddha and Phoenix are the only Beast-type fruits to have an awakening.",
        "Because of the Phoenix Flames and Feathers' Immortality passive on the [F] move, the user can stall above enemies and damage them, making it an ideal way to AFK farm money/mastery.\nSmoke and Blizzard also technically have infinite damage moves, but their moves need to be held.",
        "Smoke and Blizzard also technically have infinite damage moves, but their moves need to be held.",
        "Phoenix is the first fruit to have a Mastery Requirement in order to obtain a chip for a raid.",
        "Currently, Phoenix is one of the few fruits to have ranged M1s.",
        "The unawakened [X] move somehow heals faster than the awakened version.\nPhoenix is the first ever fruit to possess HP benefits. (excluding pre-nerf Buddha)",
        "Phoenix is the first ever fruit to possess HP benefits. (excluding pre-nerf Buddha)",
        "The transformed Phoenix resembles a creature found in Chinese myths known as Fenghuang. The Phoenix is supposed to be a symbol of grace and virtue, an immortal bird that represented beauty. Its Blox Fruits counterpart, however, depicts the Phoenix as a violent and fiery beast. This depiction is closer to the Western Phoenix, despite having the traits and features of the Fenghuang.",
        "[F] Swift Flight can be used to damage Sharks or the Leviathan while other players are attacking just by still staying on top.",
        "If the player uses awakened [C] or [Z] while using the unawakened transformation, the transformation will be cancelled.\nInterestingly, the awakened version loses the earpiece on the flight move, and attacks.",
        "Interestingly, the awakened version loses the earpiece on the flight move, and attacks.",
        "If the player starts using the transformed [X] move before being kicked out of transformation via low energy, they will shoot the transformed version instead of the normal [X] move.",
        "Awakened Phoenix's [X] move can be used with the V1 [V] move. If used with transformation, it will make the user's speed become a little slower.",
        "Holding the unawakened [X] move is a highly recommended way to get the title \"Empty Vessel\".",
        "Phoenix is the first fruit that can transform without a fury meter, the second being Leopard, the third being Mammoth and the fourth being Yeti.",
        "Sea Beasts will appear in a Phoenix raid, specifically on the 4th and 5th islands. These Sea Beasts do not drop anything and are optional to fight during the raid, as only the enemies on the raid island are required to progress to the next island. However, it is advised to defeat these Sea Beasts if possible, as they pose as extreme threats to those on the raid island. Fruits such as Buddha and Yeti are recommended against these Sea Beasts.",
        "When paired with Blood Siphon (Gear 2), the Lei accessory, gathering 5–8 enemies then using Skull Guitar [X] with the Vampiric III enchant, and activating [X] Blue Flames can result in the fastest health regeneration within the game.",
        "Although Phoenix and Portal share the robux price of (  2,000), they do not share the same Money   value. Phoenix is valued at   1,800,000 and Portal is valued at   1,900,000.",
        "In awakened form, due to the 33% hp rule, if the player resets their character or dies while transformed, they will untransform before dying, unlike other beast fruits.",
        "Phoenix is the only fruit with a transformation that can be ended in a way other than emptying a fury meter. (This way being having below 33% hp or energy).",
        "Phoenix (V2) is a balance between hunting bounty/PvP and grinding, as of short cooldown for most skills."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Phoenix"
    },
    {
      "name": "Portal",
      "rarity": "Legendary",
      "type": "Natural",
      "price_money": 1900000,
      "price_robux": 2000,
      "description": "Portal creation for teleportation; awakenable.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/8/8a/Portal_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027115746",
      "id": "portal",
      "wiki_description": "Portal creation for teleportation; awakenable.",
      "page_description": "Portal (formerly known as Door) is a Legendary Natural-type Blox Fruit that costs   1,900,000 or   2,000 from the Blox Fruit Dealer.",
      "trivia": [
        "The teleport moves do not teleport people if they have PvP disabled or if they are in a Safe Zone and not allied to the user.",
        "Portal is the first fruit that has a teleport move that other players can access.",
        "Although Portal and Phoenix share the robux price (  2,000), they don't share the same value. (Portal is valued at   1,900,000, while Phoenix is valued at   1,800,000).",
        "Portal is the first fruit that is able to bring up a separate GUI.",
        "Alongside the teleport move, Portal has the most mobility moves at four. (Phoenix is second at three)",
        "The permanent version of Portal has a lot of value, mostly because of its [C] move as it can teleport nearly anywhere.",
        "Midnight Blade and Bizarre Revolver creates portals similar to those created by Portal.",
        "None of Portal's moves have destructible physics",
        "Can be used to glitch through some walls (Ex: Igloo entrance on the cold side of Hot and Cold in the Second Sea).",
        "Shortest cooldown at 2–2.5 seconds, but it has since been nerfed to 4 seconds.",
        "The user may use any ability in the game in this state, but it will end this move.",
        "When using this ability and passing through [C] World Warp from the enemy, the invisible duration will reset upon teleportation, causing the user to become invisible again.",
        "The user can also teleport to the cursed ship without reaching Lv. 1000 through the use of this move. The enemies will still drop Ectoplasms and the user will be able to talk to the NPCs, however, the Cursed Captain will not drop the Hellfire Torch to the player, and they will not be able to accept any quests (because of the level requirement).",
        "This is a great move for escaping Portal [V] loopers as this move cannot be canceled when used no matter what damage is taken.",
        "This move could actually deal damage, even to the user. However, the amount of damage dealt was 1 damage or less, which is also why when the user teleported through the portal, the health bar on the top right appeared instead of being hidden.",
        "This move could teleport the user out of a raid and still keeps the timer. This means if the raid was beaten, they would still be awarded the fragments even if they did not actively participate in the raid. When outside the raid, the user was immune to the attacks of other players. (This has been patched in Update 27.0)",
        "The new reworked Portal C Gui shows how each teleport location looks making it easier for new players to understand Dock 1, 2, 3, 4 more easily.",
        "There's a bug that could happen by someone letting the player enter [V] Dimensional Rift and then immediately quit the game. This leads to players being able to turn off fog, which effectively helps to clarify vision.",
        "If the player is launched out of the dimension through the top portal by a high-knockback move, such as Godhuman [C], a bug may cause them to end up in a void far away from the islands.",
        "Sometimes, when the dimension despawns and a player is in it, they will fall from the sky, high above the islands.",
        "The user can use this to \"swap places\" with an enemy. However, if they use this when the enemies are really close to them, they will be at the portal where the user exits.",
        "The portals can still be used while in the void from Parallel Escape, which means that the user can use this move for transporting/escaping quickly on the battlefield.",
        "Can be opened up at any position and distance between each other, so the user can essentially trap NPCs/bosses/players in an infinite loop dealing massive damage to them along with the minor stun damage dealt from entering the portal."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Portal"
    },
    {
      "name": "Rumble",
      "rarity": "Legendary",
      "type": "Elemental",
      "price_money": 2100000,
      "price_robux": 2100,
      "description": "Lightning strikes; awakenable.",
      "image_url": "https://raw.githubusercontent.com/natsu5097/bloxgrox/main/images/fruits/rumble.png",
      "id": "rumble",
      "wiki_description": "Lightning strikes; awakenable.",
      "page_description": "Redirect to:",
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Rumble"
    },
    {
      "name": "Paw",
      "rarity": "Legendary",
      "type": "Natural",
      "price_money": 2300000,
      "price_robux": 2200,
      "description": "Paw pads to repel attacks; awakenable.",
      "image_url": "https://raw.githubusercontent.com/natsu5097/bloxgrox/main/images/fruits/paw.png",
      "id": "paw",
      "wiki_description": "Paw pads to repel attacks; awakenable.",
      "page_description": "Redirect to:",
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Paw"
    },
    {
      "name": "Blizzard",
      "rarity": "Legendary",
      "type": "Elemental",
      "price_money": 2400000,
      "price_robux": 2250,
      "description": "Snow storms; awakenable.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/c/c9/Blizzard_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027115313",
      "id": "blizzard",
      "wiki_description": "Snow storms; awakenable.",
      "page_description": "Blizzard is a Legendary Elemental-type Blox Fruit that costs   2,400,000 or   2,250 from the Blox Fruit Dealer.",
      "trivia": [
        "Blizzard is the third most expensive Elemental fruit, with Dough being the second, and Gas being the first.",
        "Blizzard is the most expensive Legendary Fruit.",
        "[V] Blizzard Domain has the largest AoE damage over time in the game, excluding Full Transformed Dragon [C] Scorching Downfall.",
        "A distinct sound effect will play if the player holds one of Blizzard's moves for at least a second, which is the same as Ice.",
        "Every move of Blizzard can break objects with Destructible Physics.",
        "[F] Tornado Flight has the same name as Awakened Sand's [F] Sand Flight.",
        "[F] Tornado Flight is highly recommended for Ship Raids as it does a lot of continuous damage.",
        "Blizzard's mastery requirements have the same amount as Rumble's and Phoenix's.",
        "Blizzard is one of the three Elemental Fruits which do not have an awakening, alongside Smoke and Gas."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Blizzard"
    },
    {
      "name": "Gravity",
      "rarity": "Legendary",
      "type": "Natural",
      "price_money": 2500000,
      "price_robux": 2300,
      "description": "Gravity control for meteors and lifts.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/5/5f/Gravity_Fruit.png/revision/latest/scale-to-width-down/268?cb=20250418030958",
      "id": "gravity",
      "wiki_description": "Gravity control for meteors and lifts.",
      "page_description": "Gravity is a Mythical Natural-type Blox Fruit that costs   2,500,000 or   2,300 from the Blox Fruit Dealer.",
      "trivia": [
        "Gravity is the cheapest Mythical fruit in the game.",
        "The second rework concept of the Gravity moves was created by concept artist @crazy_rtx.",
        "Gravity is the only fruit in the game to have 3 variants of its [M1] attacks.",
        "As of now, Gravity is the only fruit with 13 abilities, making it the fruit with the highest number of skills in the game (including [M1] clicks).",
        "The boss Orbitus uses a slightly altered version of Gravity, though the style of the moves resemble the old one.",
        "Gravity is one of the first two fruits that could obtain upgrades through the Admin Panel, the other being Eagle and soon, Creation.",
        "Gravity is one of six fruits to have a meter that is not intended for a transformation.",
        "Gravity is the only fruit in the game that requires the most tasks and items to fully upgrade it through the Admin Panel.",
        "Gravity is the second fruit to have a cutscene, the first being Control.",
        "Gravity currently has the longest cutscene of any fruit, being roughly 13.79 seconds.",
        "Gravity has been reworked two times and has two moves that are uncancellable.",
        "When going through doorways while flying, the boulder will purposely lower into the ground to allow the user to enter.",
        "[C] Gravitational Prison's upgraded version is very similar to an admin ability called \"Tensei\".",
        "The users are unable to use the max upgraded [TAP] Normal Attack while flying with Gravity. However, it still works even if they stop without ending the flight mode.",
        "Removing the stage 2 [M1] shortens the time to reach stage 3, however removing the stage 1 [M1] causes the stage 3 animation to play for a short time before becoming normal.",
        "A physical Gravity fruit can be dropped from defeating the Tyrant of the Skies, at a very low chance.",
        "Gravity and Blade are the only fruits that have had their entire moveset reworked twice.",
        "Gravity's [M1] has an alternative button on mobile located above [Z] Singularity that functions just the same as tapping, although resembles the activation of a move instead.",
        "Unlike other M1 attacks on mobile, 2 clicks are required to activate the [M1] ability.",
        "[C] Gravitational Prison's upgraded version seems to be inspired by Chibaku Tensei (Planetary Devastation) From the Naruto franchise",
        "[V] Asteroid Crash's upgraded version also appears to have taken heavy inspiration from a scene in the Battle of Titan from Avengers: Infinity War[1]"
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Gravity"
    },
    {
      "name": "Dough",
      "rarity": "Mythical",
      "type": "Natural",
      "price_money": 2700000,
      "price_robux": 2400,
      "description": "Dough manipulation; awakenable.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/0/02/Dough_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231210155057",
      "id": "dough",
      "wiki_description": "Dough manipulation; awakenable.",
      "page_description": "Dough is a Mythical Elemental-type Blox Fruit that costs   2,800,000 or   2,400 from the Blox Fruit Dealer.",
      "trivia": [
        "Dough is the second most expensive fruit to awaken, behind Lightning which costs 21,500 fragments",
        "All of the awakened abilities are affected by Aura Colors, changing the outline in all the moves and \"electricity\" effects (the only other fruits in which the moves are affected by the Aura Color being Rubber and Spider).",
        "Dough is the only fruit in the entire game who's attacks are buffed by Aura, specifically its [TAP] Normal Attack and [Z] Missile Jab when awakened.\nAdditionally, depending on whether the user has Aura activated or not, the sound effects of Dough's [TAP] Normal Attack and [V] Dough Fist Fusillade will be different.",
        "Additionally, depending on whether the user has Aura activated or not, the sound effects of Dough's [TAP] Normal Attack and [V] Dough Fist Fusillade will be different.",
        "There are multiple glitches with Dough, including:\nThe [X] Pastry River ability can get the user stuck in place and make them unable to move until they get killed or reset, and using the ability mid-air can sometimes result in the opponent getting glitched out of the map.\nWhen the user uses [X] Pastry River (Air) on the player with at least 1 hp left, after respawning (if fist barrage is still going) when the downslam occurs, that player will be teleported in EXACT same place as the center of the downslam.\nIf the user is getting hit by the [V] Dough Fist Fusillade ability and someone attacks the Dough user, they will be locked in place until death or leaving.\nThis can also happen if the user is holding the ability and then exits the game.\nIf the user dashes, jumps, and uses the [TAP] Normal Attack all at the same time, they will dash further than normal, similarly to Skull Guitar, but less effective.",
        "The [X] Pastry River ability can get the user stuck in place and make them unable to move until they get killed or reset, and using the ability mid-air can sometimes result in the opponent getting glitched out of the map.",
        "When the user uses [X] Pastry River (Air) on the player with at least 1 hp left, after respawning (if fist barrage is still going) when the downslam occurs, that player will be teleported in EXACT same place as the center of the downslam.",
        "If the user is getting hit by the [V] Dough Fist Fusillade ability and someone attacks the Dough user, they will be locked in place until death or leaving.\nThis can also happen if the user is holding the ability and then exits the game.",
        "This can also happen if the user is holding the ability and then exits the game.",
        "If the user dashes, jumps, and uses the [TAP] Normal Attack all at the same time, they will dash further than normal, similarly to Skull Guitar, but less effective.",
        "When the user uses the [Z] Missile Jab or [X] Pastry River (Air variant) abilities, they can see that their arm disappears but rebuilds itself with mass.",
        "Dough's unawakened [X] Sticky Dough and [C] Carved Dough abilities bear a visual resemblance to an ability from an old game made by mygame43, Elemental Battlegrounds.",
        "If the user uses Dough's [C] Piercing Clothesline while not using any Aura Colors, the effects will be red by default.",
        "If two Dough users use [C] Piercing Clothesline against each other, both of them will hit, but no one would take damage.",
        "Dough’s [C] Piercing Clothesline (awakened/unawakened) can be used as an alternative for its [F] Scorching Donut move (awakened/unawakened), but only for up to four seconds.",
        "[V] Dough Fist Fusillade will appear with bigger hands when used with aura, while without it will appear significantly skinnier.",
        "Dough is the only Mythical fruit that can be awakened.",
        "Dough is the first Mythical Elemental fruit, while the second is Gas.\nDough used to be a Natural fruit that had the Elemental Reflex passive only if the user's Instinct was turned on, but this was later changed, and Dough was made entirely Elemental.",
        "Dough used to be a Natural fruit that had the Elemental Reflex passive only if the user's Instinct was turned on, but this was later changed, and Dough was made entirely Elemental.",
        "Awakened Dough's [Z] Missile Jab ability projectile is actually a small aura-covered fist after being fired.",
        "If the player uses the [C] Piercing Clothesline ability with Ghost's Resurrection Passive active, the swinging arm will appear translucent.",
        "Repeatedly using awakened [TAP] Normal Attack and/or aiming the [V] Dough Fist Fusillade move in the same spot will leave a crack on the ground, which increases in size the more the user punches in that spot. When using [V] Dough Fist Fusillade, the crack will briefly appear \"scorched\".",
        "As of update 27.1, if the user uses [C] Piercing Clothesline or [F] Scorching Donut in the Submerged Island, they will begin to rapidly accelerate upwards, either forcing them to exit or even drown."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Dough"
    },
    {
      "name": "Shadow",
      "rarity": "Mythical",
      "type": "Natural",
      "price_money": 2900000,
      "price_robux": 2425,
      "description": "Shadow control and umbrakinesis.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/5/58/Shadow_Fruit.png/revision/latest/scale-to-width-down/268?cb=20241229033053",
      "id": "shadow",
      "wiki_description": "Shadow control and umbrakinesis.",
      "page_description": "Shadow is a Mythical Natural-type Blox Fruit that costs   2,900,000 or   2,425 from the Blox Fruit Dealer.",
      "trivia": [
        "Shadow is the only fruit that allows the user to utilize the life drain mechanic (just like Ghoul's life leech) by using [C] Nightmare Leech.",
        "Shadow is the only fruit with the Umbra Meter as it was designed only for itself.",
        "\"Umbra\" in Latin means \"shade\" and/or \"shadow\", and \"Corvus\" in Latin refers to a \"raven\" or a \"crow\", both being types of birds. This ties into how many of the fruit's abilities have to do with crows/ravens flying at the enemy.",
        "Shadow's [Z], [X], [C] moves are quite similar to Godhuman's [Z], [X] (Tap Variant) and [C].",
        "Shadow is the rarest and most expensive fruit obtainable from a Fruit Box.",
        "This fruit has low value in trading due the low versatility and overall negligence."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Shadow"
    },
    {
      "name": "Venom",
      "rarity": "Mythical",
      "type": "Natural",
      "price_money": 3000000,
      "price_robux": 2450,
      "description": "Poison clouds and attacks.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/d/d2/Venom_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027120425",
      "id": "venom",
      "wiki_description": "Poison clouds and attacks.",
      "page_description": "Venom is a Mythical Natural-type Blox Fruit that costs   3,000,000 or   2,450 from the Blox Fruit Dealer.",
      "trivia": [
        "Venom's transformation model was made by Mary (@Marubravery on X).",
        "Venom is the only fruit that starts with the letter \"V\".",
        "Venom shares similarities with Magma, as both have abilities that create puddles that cause damage over time. Their damage stacks as well, making them deal incredible amounts of damage.",
        "When transformed, the user is \"immune\" to all environment lava puddles, such as those found in Raids or on the island Hot and Cold (this is because the hitbox when transforming is above the lava, preventing the user from taking damage). The user, however, can be harmed by the lava puddles by being dragged down by an ability such as Awakened Flame's [V].",
        "There was a glitch when if the user transforms and immediately sits on a chair, the multi-headed dragon's walking, jumping and idle animation is replaced with a T-Pose that appears one second before the animations load in. Doing this does not drain the user's Fury Meter and jumping will make them Air Jump instead. After pressing [V] again, the game still believes the player is sitting and does not allow them to jump but they will be able to move. To be able to jump again, the player needs to either reset, get killed, or leave the game. This glitch has been patched.",
        "Venom transformation works similarly to the Awakened Buddha, gaining reduced dash and acceleration buffs from accessories.",
        "It is recommended to use Ghoul V3, Shark V2/V3 passive, or Human V3 while using Venom. Ghoul reduces cooldowns even more for Venom, Shark takes no damage in water and Human buffs the damage.",
        "Venom has the one of the largest AoE in the game, which is [C] Toxic Fog when transformed. (The other being Awakened Quake [V], Blizzard [V], and transformed Eastern/Western Dragon [C] and [Z]).",
        "Sometimes, transformed [C] Toxic Fog only does one cycle of poison damage. This could be a bug.",
        "Despite Venom having a transformation and having a Meter mechanic, it is not a Beast fruit, making it the first and only Natural fruit with a transformation and a meter mechanic.",
        "Venom is a good counter to Awakened Dough, as most of Dough's moves need to be held to deal maximum damage. Venom is able to interrupt Dough moves and combos very well, mainly Dough's [X] and [V] moves. However, using T-Rex transformation would be more effective.",
        "Just like Dragon and T-Rex, Venom's Fury Meter needs 1 minute and 30 seconds to fully recharge.",
        "Venom is the only Natural fruit to have a Fury Meter.",
        "Venom is currently one of the Blox Fruits that are very outdated. (The other fruits being Control, and Shadow )",
        "Venom, Spirit and Classic Dragon are the only fruits not to receive a model rework in Update 20.",
        "Venom's flight move is one of the flight moves that, instead of getting slower the lower the user's health is, it gets faster, much like Sound.",
        "Untransformed [C] is one of, if not, the quietest attacks of a fruit."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Venom"
    },
    {
      "name": "Control",
      "rarity": "Mythical",
      "type": "Natural",
      "price_money": 3200000,
      "price_robux": 2500,
      "description": "Levitate and crush objects.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/1/19/Control_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027115345",
      "id": "control",
      "wiki_description": "Levitate and crush objects.",
      "page_description": "Control is a Mythical Natural-type Blox Fruit that costs   3,200,000 or   2,500 from the Blox Fruit Dealer.",
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Control"
    },
    {
      "name": "Spirit",
      "rarity": "Mythical",
      "type": "Natural",
      "price_money": 3400000,
      "price_robux": 2550,
      "description": "Summon spirits for buffs and attacks.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/6/66/Spirit_Fruit.png/revision/latest/scale-to-width-down/268?cb=20240304190559",
      "id": "spirit",
      "wiki_description": "Summon spirits for buffs and attacks.",
      "page_description": "Spirit (formerly known as Soul) is a Mythical Natural-type Blox Fruit that costs   3,400,000 or   2,550 from the Blox Fruit Dealer.",
      "trivia": [
        "Cursed Tree is the only buddy whose form was not changed during the rework in Update 17.3.",
        "Due to the nerf in update 24 to Angel's V3 ability, the healing ability of the stars offers a great alternative for those looking to heal in a pinch. Much like Angel's V3 ability, making it ideal in the heat of battle.",
        "There was a bug where if the user activated the flying pig's speed and then switched to another permanent fruit, they could keep the speed from the flying pigs. This glitch could be stacked and therefore abused, as continuous repeating of it would lead to tremendous amounts of speed. Some YouTube videos even state that 2 dashes were enough to go across Castle on the Sea. (Patched in Update 20)",
        "The [X] move has a visual bug that makes it slightly hard to land from afar, but it is easier to use when aiming under the user's avatar.",
        "Spirit is also sometimes used in skilled builds as it requires moderate aim to use."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Spirit"
    },
    {
      "name": "Dragon",
      "rarity": "Mythical",
      "type": "Beast",
      "price_money": 3500000,
      "price_robux": 2600,
      "description": "Dragon transformation with fire breath; awakenable.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/2/29/Dragon_Fruit.png/revision/latest?cb=20241218114129",
      "id": "dragon",
      "wiki_description": "Dragon transformation with fire breath; awakenable.",
      "page_description": "Dragon is a Mythical Beast-type Blox Fruit that costs   15,000,000 or   5,000 from the Blox Fruit Dealer.",
      "trivia": [
        "The Dragon Fruit can also be obtained from the    Dragon Eggs at the Prehistoric Island with an extremely low chance, being able to get either the East or West variants.",
        "Dragon is the most expensive and difficult-to-obtain fruit in the game.",
        "Before Update 24, Dragon was the third most expensive fruit in the game, with the first being Kitsune and the second being Leopard.",
        "Before Update 17.3, Dragon was once again the most expensive fruit in the game, valued   3,500,000. This is the second time that Dragon is the most valuable fruit.",
        "Pre-rework, Dragon costed   2,600, which increased by 92.3% up to   5,000 post-rework, making it by far the highest Robux price increase of any purchasable item in the game.\nSimilarly, it also has the highest Money price increase of any reworked item, going from   3,500,000 to   15,000,000. According to the calculations, the price of that is increased by 328.57%.",
        "Similarly, it also has the highest Money price increase of any reworked item, going from   3,500,000 to   15,000,000. According to the calculations, the price of that is increased by 328.57%.",
        "Mastery gained will be common to both Dragon variations.",
        "Dragon has the largest transformed model in the game.",
        "The transformed Eastern form dragon resembles a creature commonly found in Chinese myths, specifically a long, whereas the Western represents a European folklore Dragon, specifically a wyvern. Additionally, the Eastern Dragon is supposed to be the ruler of seas and bodies of water, unlike its Blox Fruits counterpart, whose moves are mostly fire-based.\nDragon's Western version is also similar to a fan-made Wyvern fruit showcased in the 2024 fan art competition.\nAdditionally, in most Chinese myths, Eastern Dragons are depicted to have control over the weather, thus allowing them to wield water, thunder and wind.",
        "Dragon's Western version is also similar to a fan-made Wyvern fruit showcased in the 2024 fan art competition.",
        "Additionally, in most Chinese myths, Eastern Dragons are depicted to have control over the weather, thus allowing them to wield water, thunder and wind.",
        "Dragon and Kitsune are the only beast fruits that, while transformed, can carry players on their backs. However, Dragon needs Saddle/Strong Hair to carry someone on their back.",
        "Dragon and Kitsune are the only fruits that can be obtained from Sea Events such as the Kitsune Shrine and Prehistoric Island.",
        "The user can measure how fast they are moving using the Dragon's Hybrid form. The higher the speed, the higher the volume and pitch of the footsteps of the hybrid.",
        "Dragon is the first fruit to have two versions on its transformation and fruit model.",
        "Dragon has the highest damage reduction in the game.",
        "Using a Race Awakening transformation while using the hybrid form drains the user's Fury Meter.",
        "Having the permanent version of Dragon allows the user to choose the version of the fruit used. (Either Western or Eastern.)",
        "Sometimes, a bug can happen with the Western Dragon where if the user untransforms, they will not be able to move. In the case of the Eastern Dragon, this bug causes players who untransformed to have a larger hitbox, allowing them to collect items such as fruits and chests much further than supposed and makes users sit in chairs frequently. This can be fixed by resetting the character or transforming into the hybrid form.",
        "Dragon is considered one of the best fruits for Leviathan hunt because the M1 hybrid form can deal insane damage. The reason it's better than Magma is because its ability is easier to target than moving targets like segment and limits knockback when spamming M1. However, for the head, Magma is still better.",
        "Interestingly, Dragon's icon in the shop is the only icon that goes out of the margin.",
        "Dragon is the second fruit that has two icons, the other being Control.",
        "Dragon's untransformed [C] Scorching Downfall has a similar look to Light's [X] Barrage of Light.",
        "The icon on inventory of the permanent dragon looks merged.",
        "Dragon is the first fruit in the Stock menu to have a unique plaque, being changed in Update 24.",
        "There is a glitch where discounted Dragon appears on the recommended fruits bar.",
        "There is a glitch where if the player transforms, they are sometimes \"invisible\" to other players.",
        "Dragon was the first fruit to receive the 'in-progress' status, followed by Gravity as the second, both Barrier and Falcon as the third, Pain as the fourth, and Rumble as the fifth.",
        "Dragon (East)'s full transformation emits growling sounds, unlike the Western counterpart.",
        "As of Update 27.1, Dragons are rollable for the first time since Updates 22-23.",
        "Due to recent changes of the Dragon (especially East), Sea Beasts can drain the user's Fury Meter to negative.\nCyborg's Energy Core V3 ability can also drain Dragon (East)'s fury meter in seconds.",
        "Cyborg's Energy Core V3 ability can also drain Dragon (East)'s fury meter in seconds."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Dragon"
    },
    {
      "name": "Leopard",
      "rarity": "Mythical",
      "type": "Beast",
      "price_money": 5000000,
      "price_robux": 3000,
      "description": "Leopard form with speed and power.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/a/a3/Leopard_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027115615",
      "id": "leopard",
      "wiki_description": "Leopard form with speed and power.",
      "page_description": "Leopard is a Mythical Beast-type Blox Fruit that costs   5,000,000 or   3,000 from the Blox Fruit Dealer.",
      "trivia": [
        "During Leopard's Transformation ([V]), the user will gain a moderate speed boost/buff. Using Rabbit V3 and the Pilot Helmet add up even more speed buffs. Combining all of them can make the user surpass the speed of Awakened Light's [F] (Shining Flight), which is the second fastest flight move in the game.",
        "When transformed, the user is \"immune\" to all environment lava puddles, such as those found in Raids or on the island Hot and Cold (This is because the hitbox when transforming is above the lava, preventing the user from taking damage). The user, however, can be harmed by the lava puddles by being dragged down by an ability such as Flame's V move.",
        "After the usage of [C] Afterimage Assault, the user will gain a temporary but strong speed boost/buff and giving them slightly faster M1's while being lit on fire. Keep in mind that this effect will not change any other attribute/aspect of the user. (Damage, Defense, Health, etc.)\nThis move can also be added onto the transformation combination to make it even faster.",
        "This move can also be added onto the transformation combination to make it even faster.",
        "Mammoth, Eagle, Buddha, Yeti, Phoenix, and Leopard transformations do not have a time limit or Fury Meter unlike fruits such as Dragon, Venom, T-Rex, Gas or Kitsune without getting damaged, which means the user can stay transformed for as long as they like.\nThe exception is Phoenix's transformation, since it depends from amount of energy and HP the player has.",
        "The exception is Phoenix's transformation, since it depends from amount of energy and HP the player has.",
        "Jumping into [X] Spiraling Kick while it is moving will cause it to carry the player forward for a short distance. Do note that this most often works on devices with poor connections.",
        "When transforming, a faint leopard ghost appears above the user with red glowing eyes for a few milliseconds. If the player is entering the server for the first time, the leopard model may sometimes appear T-posing.",
        "Leopard's [M1] attacks (Roar) can damage Sea Beasts.",
        "Leopard is widely considered a spammable fruit. Using the combination of Zebra Cap, Ghoul V3/V4, which has the ability to reduce cooldowns, will massively contribute to the fruit's spammability, so much that if used properly, the player can almost use the moves continuously.",
        "When transformed, the player keeps their hair/hat.",
        "Yeti and Leopard are the third pair of fruits to share the same price, the second being Gas and Control, and the first being Mammoth and T-Rex.",
        "Yeti is considered the rival of this fruit.",
        "[Z] Finger Revolver and [X] Spiraling Kick can fling fruits on the ground."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Leopard"
    },
    {
      "name": "Kitsune",
      "rarity": "Mythical",
      "type": "Beast",
      "price_money": 8000000,
      "price_robux": 4000,
      "description": "Fox transformation with illusions and blue fire; awakenable.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/6/65/Kitsune_Fruit.png/revision/latest/scale-to-width-down/268?cb=20241223162956",
      "id": "kitsune",
      "wiki_description": "Fox transformation with illusions and blue fire; awakenable.",
      "page_description": "Kitsune is a Mythical Beast-type Blox Fruit that costs   8,000,000 or   4,000 from the Blox Fruit Dealer.",
      "trivia": [
        "Kitsune is the second fan-made fruit to be added to the game, with the first being Sound.\nThe original concept was created by @Kuzuryu_Kei (X Handle), one of the winners of the first fan fruit/art contest.",
        "The original concept was created by @Kuzuryu_Kei (X Handle), one of the winners of the first fan fruit/art contest.",
        "Kitsune is currently the second most expensive fruit in the game.",
        "Kitsune is the first Beast fruit that allows allied players to mount, the second being Dragon.",
        "It is worth noting that Agility (Rabbit's V3 ability) does not have nearly as much effect as when not transformed. While it is noticeable, it is mostly negligible.",
        "Despite being based on a nine-tailed fox, Kitsune normally only has three tails and five tails when transformed; this is probably due to the design of the model, although it still has nine tails in the icon.\nThe same happens to Inventory Icon and Physical Fruit, while the Inventory Icon model has 4 tails, Physical Fruit only has 3 tails.",
        "The same happens to Inventory Icon and Physical Fruit, while the Inventory Icon model has 4 tails, Physical Fruit only has 3 tails.",
        "When walking whilst using Kitsune with two or more tails, the player animation will shift from crawling on all fours to an upright & happy skipping animation.",
        "Kitsune used to have a move called \"Tailed Beast Bomb\" as its [C] move, which got changed into \"Fox Fire Disruption\" and the [F] move, \"Wild Assault\" , was called \"Swift Assault\" in the fruit's sneak peek.",
        "All of Kitsune's moves (excluding [V]) can only be held for 12 seconds.",
        "In the fan made design, the [X] move was called \"Claws of Burning Agony\" which was changed to \"Tails of Burning Agony\" in the game.",
        "A physical Kitsune Fruit can also be obtained at a very low chance (0.1%) by offering Azure Embers to the Kitsune Shrine in the Third Sea.",
        "There was a bug involving Love's [F] Flamingo Ride, where If an allied player mounted the Kitsune user, the Love user could \"kidnap\" the allied player, and that player would ride on the Flamingo. However, once the Love user cancelled their [F] Flamingo Ride, the player who was previously mounting the Kitsune user would teleport back into the saddle. This bug is now patched."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Kitsune"
    },
    {
      "name": "T-Rex",
      "rarity": "Mythical",
      "type": "Beast",
      "price_money": 2700000,
      "price_robux": 2350,
      "description": "T-Rex transformation with massive strength.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/d/d9/T-Rex_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231226191220",
      "id": "t-rex",
      "wiki_description": "T-Rex transformation with massive strength.",
      "page_description": "T-Rex is a Mythical Beast-type Blox Fruit that costs   2,700,000 or   2,350 from the Blox Fruit Dealer.",
      "trivia": [
        "T-Rex has been nominated to be added to the game since Update 7.",
        "T-Rex has the same price as Mammoth, both costing   2,700,000 or   2,350.\nThis also makes T-Rex one of the only fruits that share a monetary value with another fruit, with the second being Control and Gas, and the third being Leopard and Yeti.\nEven though T-Rex has the same value as Mammoth, however, T-Rex has more demand in terms of trading.",
        "This also makes T-Rex one of the only fruits that share a monetary value with another fruit, with the second being Control and Gas, and the third being Leopard and Yeti.",
        "Even though T-Rex has the same value as Mammoth, however, T-Rex has more demand in terms of trading.",
        "T-Rex is one of the few fruits to leave effects on nearby users' screens when using a move/transformation.",
        "The player has a tail while they have T-Rex equipped. This is only cosmetic and does not add anything, unlike Kitsune's Tails.\nThis also adds to the fact that T-Rex is one of the only Beast fruits to add cosmetics to the user, along side Eagle.",
        "This also adds to the fact that T-Rex is one of the only Beast fruits to add cosmetics to the user, along side Eagle.",
        "Due to the infliction of tick damage on enemies during the transformation, T-Rex can excel in PvP, being able to damage the enemy even at exceedingly high distances. It can also let the user see where the opponent is, making it very hard for them to escape.\nThe Prey Mark's tick damage works best when inflicting damage and then getting teleported to Portal's [V] (Dimensional Rift).\nThis also works surprisingly well with it's [C] (World Warp).",
        "The Prey Mark's tick damage works best when inflicting damage and then getting teleported to Portal's [V] (Dimensional Rift).",
        "This also works surprisingly well with it's [C] (World Warp).",
        "For some reason, using T-Rex will grant a higher chance of marking the user's kill as a \"Suspicious Kill\" (which doesn't reward bounty for the kill and doesn't make the killed player lose bounty), even if all moves are used during the fight and are not spammed.",
        "T-Rex, along with Dragon and Gas, are the only unawakenable Blox Fruits that have unique transformation names ([V] Reptilian Scales for T-Rex and [V] Imperial Evolution for Dragon and [V] Vapour Condensation for Gas ).",
        "T-Rex has a glitch that allows to go through the sea in transformation by using [C] Hunter's Rage skill while aiming down in the water, though they will die instantly. The user will keep falling through the map if they have Shark race and teleport back at the spawn point of the last island they stepped on.",
        "If the opponent stays at the edge of T-Rex's [X] move, they could walk out of it as they are not fully stunned.",
        "The in-game T-Rex's design bears resemblance to transformed Dragon's western variant, due to the curved, backwards facing horns on both their heads. Their relation is further implied by the fact that both T-Rex and Dragon are linked to the Prehistoric Island."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/T-Rex"
    },
    {
      "name": "Mammoth",
      "rarity": "Mythical",
      "type": "Beast",
      "price_money": 2700000,
      "price_robux": 2350,
      "description": "Mammoth transformation with charge attacks.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/9/95/Mammoth_Fruit.png/revision/latest/scale-to-width-down/268?cb=20231027115702",
      "id": "mammoth",
      "wiki_description": "Mammoth transformation with charge attacks.",
      "page_description": "Mammoth is a Mythical Beast-type Blox Fruit that costs   2,700,000 or   2,350 from the Blox Fruit Dealer.",
      "trivia": [
        "The impact from jumping works the opposite way from Awakened Buddha. Buddha's jump damage applies on the initial jump from the ground, as for Mammoth, it applies on its landing. The impact from jumping can reset air jumps. This can be useful in evading water for players not of the Shark race by touching the surface of the water to reset air jumps while taking little to no damage.",
        "The silhouette of its beast form can be seen when using its untransformed skills (excluding the [V] move).",
        "The [X] move on Twin Hooks, Prehistoric Punt, parallels the [X] move on Mammoth, True Prehistoric Punt.",
        "If the player pairs Bear Ears and Shark race with Mammoth, their damage reduction will be increased from 50 to about 70%. With Water Body, the player's damage reduction will increase from about 70% to about 80% due to Water Body boosting their defense by 65% for 4.5 seconds. (Recommended to get Race Awakening due to Shark V3 being heavily nerfed)",
        "If the player pairs Bear Ears and Cyborg race (V2 and above) with Mammoth, its passive damage reduction will be raised from 55% to about 62% for any attack, and for attacks by Melee, Sword or Gun the player will have 85.5%. With the [T] ability active, the player will have ~69% in any attack and for attacks by Melee, Sword and Gun the player will have ~72%.",
        "Mammoth is one of three pairs of fruits to share the same monetary value. The other two pairs are Control and Gas at   3,200,000 or   2,500, Yeti and Leopard at   5,000,000 or   3000.\n(Shared with T-Rex at   2,700,000 or   2,350)",
        "(Shared with T-Rex at   2,700,000 or   2,350)",
        "Mammoth is the third fruit that doesn't need a Fury Meter to transform. (The first being Phoenix, second being Leopard, fourth being Yeti)",
        "When getting hit by a move that has a grabbing animation while transformed, such as Dragon [X], the user will fly in weird ways that should be normal when at the size of a regular player, making it look comical in some sorts."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Mammoth"
    },
    {
      "name": "Celestial",
      "rarity": "Mythical",
      "type": "Natural",
      "price_money": 8000000,
      "price_robux": 4500,
      "description": "Celestial powers, introduced in recent updates.",
      "image_url": "https://raw.githubusercontent.com/natsu5097/bloxgrox/main/images/fruits/celestial.png",
      "id": "celestial",
      "wiki_description": "Celestial powers, introduced in recent updates."
    },
    {
      "name": "Creation",
      "rarity": "Mythical",
      "type": "Natural",
      "price_money": 9000000,
      "price_robux": 5000,
      "description": "Creation and manipulation abilities.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/4/44/Creation_Fruit.png/revision/latest/scale-to-width-down/268?cb=20250913215446",
      "id": "creation",
      "wiki_description": "Creation and manipulation abilities.",
      "page_description": "Creation (formerly known as Barrier) is a Legendary Natural-type Blox Fruit that costs   1,400,000 or   1,750 from the Blox Fruit Dealer.",
      "trivia": [
        "Creation is the fourth fruit to get a rarity change, the first being Portal, second being Love, and third being Ghost.",
        "Creation has the lowest Mastery requirements to get all the moves in the Legendary rarity.",
        "When the physical Creation fruit breaks apart during its animation, the broken pieces will fall to a nearby surface. If the player teleports while holding out the fruit, the pieces will teleport back to within the vicinity of the fruit.",
        "Creation is the first fruit to gain a different moveset, via Build Mode, without being awakened or transformed.",
        "If the user leaves the server, all the buildings they have created will vanish.",
        "Interestingly, allied players can just walk through the towers from [V] Magic City, instead of teleporting or being bounced back.\nThis may have been a balancing feature to make the towers not so obstructing for allies that are trying to help.",
        "This may have been a balancing feature to make the towers not so obstructing for allies that are trying to help.",
        "Creation is the only fruit with abilities that specialize in blocking attacks, which makes it extremely unique.",
        "When used on a physical fruit, [V] Magic City will move the fruit away from its original location.",
        "Creation's held M1 cannot be used on mobile normally. Instead, there is an alternative button located above [Z] Batter Up that functions just the same as tapping, although resembles an activation of a move instead. This feature is also present in Gravity, although it's held M1 can be used normally."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Creation"
    },
    {
      "name": "Eagle",
      "rarity": "Uncommon",
      "type": "Beast",
      "price_money": 5500000,
      "price_robux": 975,
      "description": "Eagle transformation with enhanced mobility.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/5/53/Eagle_Fruit.png/revision/latest/scale-to-width-down/268?cb=20250418030931",
      "id": "eagle",
      "wiki_description": "Eagle transformation with enhanced mobility.",
      "page_description": "Eagle (formerly known as Falcon) is an Uncommon Beast-type Blox Fruit that costs   550,000 or   975 from the Blox Fruit Dealer.",
      "trivia": [
        "A physical Eagle Fruit can be obtained from defeating the Tyrant of the Skies at a relatively low chance.",
        "Eagle is one of the four fruits that can be upgraded in the Admin Panel, the other being Gravity, Lightning, and Pain.",
        "Eagle is the first Uncommon fruit to have a meter.",
        "Eagle is also the only Uncommon beast fruit.",
        "Eagle is one of the only fruits to have a skin, and the first uncommon to have one.",
        "Eagle is the only Beast-type fruit that does not have a full transformation.",
        "The physical eagle fruit is the smallest fruit model, this might be because the particle effects would cause lag when put at the scale of a regular fruit size.",
        "Eagle is the only fruit that cost the same amount of money as a removed fruit in the game, Revive fruit. (Old Ghost fruit)",
        "Parrot and Falcon skins are the only skins that do not actually depict a variation of Eagle, but rather another species of bird.\nFalcon is a reference to the Falcon fruit, while Parrot was a chromatic concept for Falcon that the developers decided to add to the game as an Eagle skin.",
        "Falcon is a reference to the Falcon fruit, while Parrot was a chromatic concept for Falcon that the developers decided to add to the game as an Eagle skin.",
        "Eagle is the third fruit whose [F] ability requires the highest mastery, the first one being Rocket and the second being Blade.",
        "Eagle's [F] Flight animation and sound are similar to awakened Phoenix [V] Full Transformation, as both make the scream of a Red-tailed hawk and spin in the air.",
        "Eagle's feathers are similar to the Angel V3 particle effects.",
        "Eagle is the only fruit which makes another accessory disappear (being Angel's wings, also for cyborg v4 wings ).",
        "A real life bald eagle typically cruise at around 13.5 meters per second, and soar at speeds up to 45 meters per second. The in-game counterpart, however, flies at 10 meters per second with first upgrade or higher, and approximately 40-44 meters per second when lunging forwards with [V] Soaring Talon or upgraded [F] Flight (held).\nDespite being one of the fastest flying creatures in the real world, Eagle's speed is considered slow in a universe where everything else has magical powers.\nKeep in mind that an Eagle user is generally larger than an average bald eagle, decreasing the speed to body length ratio of an eagle user.\nBody length to speed ratio means the top speed of an animal versus the size of the animal. For example, a transformed West Dragon flies at absurdly high speeds because it happens to be quite huge, maintaining the fair body length to speed ratio. However, a transformed Phoenix flies slightly faster than Eagle, despite being roughly the same size. This meant that Eagle has a slightly lower body length to speed ratio, making Eagle appear slow.",
        "Despite being one of the fastest flying creatures in the real world, Eagle's speed is considered slow in a universe where everything else has magical powers.",
        "Keep in mind that an Eagle user is generally larger than an average bald eagle, decreasing the speed to body length ratio of an eagle user.\nBody length to speed ratio means the top speed of an animal versus the size of the animal. For example, a transformed West Dragon flies at absurdly high speeds because it happens to be quite huge, maintaining the fair body length to speed ratio. However, a transformed Phoenix flies slightly faster than Eagle, despite being roughly the same size. This meant that Eagle has a slightly lower body length to speed ratio, making Eagle appear slow.",
        "Body length to speed ratio means the top speed of an animal versus the size of the animal. For example, a transformed West Dragon flies at absurdly high speeds because it happens to be quite huge, maintaining the fair body length to speed ratio. However, a transformed Phoenix flies slightly faster than Eagle, despite being roughly the same size. This meant that Eagle has a slightly lower body length to speed ratio, making Eagle appear slow."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Eagle"
    }
  ],
  "fightingStyles": [
    {
      "name": "Combat",
      "price_money": 0,
      "description": "Basic melee fighting style.",
      "sea": "First Sea",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/7/7c/Combat.png/revision/latest/scale-to-width-down/268?cb=20241223042632",
      "id": "combat",
      "wiki_description": "Basic melee fighting style.",
      "page_description": "It is recommended to buy another fighting style such as Dark Step, Electric, or Water Kung Fu quickly as combat is generally deemed to be very bad for grinding and PvP. Compared to the available fighting style options in the First Sea, Combat is generally extremely weak.",
      "trivia": [
        "Combat is by far the most realistic fighting style in-game as it is the only one that does not use attacks out of magical elements such as fire, water, magic and electricity.",
        "Combat is considered the rarest thing in the game, as once the user changes their fighting style they cannot get it back.",
        "Combat is the only fighting style that only has two moves.",
        "Combat is the only fighting style without an icon, and it is simply presented as \"Combat\".",
        "Combat is the only fighting style that cannot be learned back after using another fighting style.\nCombat can only be learned again through admin commands.",
        "Combat can only be learned again through admin commands.",
        "Combat has the second slowest M1s, Dark Step having the slowest.",
        "Combat's moves are similar to the [C] and [X] moves of Superhuman and Godhuman.",
        "Most Enemies use the M1 of Combat.",
        "Raiders use the [M1] and the [Z] move of Combat.",
        "Combat has the most realistic idle stance of all Fighting Styles, as it resembles a real-life boxing guard.",
        "[Z] Quick Tackle cannot hit normal sized NPCs and players on the ground while using unawakened and awakened Buddha's transformation. This is because Buddha's hitbox is above the ground, and as [Z] Quick Tackle cannot be aimed vertically and [X] Ground Smash has a small hitbox, only the M1s can be used while transformed."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Combat"
    },
    {
      "name": "Dark Step",
      "price_money": 150000,
      "description": "Fast kicks with dark energy.",
      "sea": "First Sea",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/3/39/Dark_Step.png/revision/latest/scale-to-width-down/268?cb=20220228201917",
      "id": "dark-step",
      "wiki_description": "Fast kicks with dark energy.",
      "page_description": "If the player activates Aura while Dark Step is equipped, the Aura will appear on the player's legs instead of their arms. This is entirely visual and provides no additional buffs compared to Aura on the arms in the same stage.",
      "trivia": [
        "Dark Step is considered to be the best fighting style for grinding aura mastery.",
        "If the user uses [V] Overheat and goes into Light's [F] Light Flight, the flames will get all messed up.",
        "If [V] Overheat is used over 100 times, the user will have both legs on fire upon using it again, similar to Death Step's [V] move which doesn't have a requirement for both legs to be on fire and has it from the start upon use.",
        "If the user uses [V] Overheat, and then switches to another fighting style, the user's legs will still be on fire without an expiration timer. Hence, it is possible to get both flame legs and flame fists by activating the move and equipping Dragon Talon. This effect only gets removed if the player dies or rejoins, and it is purely cosmetic if they switch to another fighting style. The expiration timer is however restored if using the [V] move again.",
        "The damage multiplier is only applied while using Dark Step or Death Step's moves, so the user cannot use this to get extra damage on other moves.",
        "If the player has Dark Step or Death Step equipped, their Aura stages will start at their legs, instead of their hands.",
        "[C] Barrage is similar to Rubber's [C] Rush.",
        "If the user uses [C] Barrage and quickly switch fighting styles while holding it, they will be stuck in the animation.",
        "Dark Step is the one of the only two fighting styles to have four moves, the other being its successor, Death Step.",
        "In Update 9 Dark Step was almost renamed to Fire Feet.",
        "By equipping Death Step/Dark Step and climbing to a ladder, the user will climb with their legs instead of their hands, due to the user's hands being on their waist.",
        "Dark Step is chronologically the first fighting style that the player can purchase.",
        "Similar to Death Step, Dark Step's [V] Overheat can permanently be activated by using Ghoul V3 to ignore 40% of the final cooldown time. However, for Death Step, the user needs to wait until the move expires, otherwise it will only disable the flames and they will need to wait longer to be able to use it again."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Dark%20Step"
    },
    {
      "name": "Electric",
      "price_money": 500000,
      "description": "Electric-enhanced punches.",
      "sea": "First Sea",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/2/2f/Electric.png/revision/latest/scale-to-width-down/268?cb=20220228215637",
      "id": "electric",
      "wiki_description": "Electric-enhanced punches.",
      "page_description": "Electric can be great for beginners as it can do some fairly decent damage and also stun enemies. All of the moves are AoE so that beginners can grind enemies, by grouping them up easily and hit them at once.",
      "trivia": [
        "Due to having electrical properties, Electric cannot harm Rubber users due to Rubber being immune to electricity.",
        "While Electric is equipped, the user's hands will be covered in electricity, though this is purely cosmetic."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Electric"
    },
    {
      "name": "Water Kung Fu",
      "price_money": 750000,
      "description": "Water-based fluid movements.",
      "sea": "Second Sea",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/8/8f/Water_Kung_Fu.png/revision/latest/scale-to-width-down/268?cb=20220228233922",
      "id": "water-kung-fu",
      "wiki_description": "Water-based fluid movements.",
      "page_description": "Water Kung Fu is considered by many as one of best fighting styles for grinding because the M1s are very fast and does not cause the user to dash. (Unlike its upgrade Sharkman Karate)",
      "trivia": [
        "Water Kung Fu is the most expensive fighting style in the First Sea.",
        "The unreworked version of [X] Deadly Shower is used by Sea Beasts."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Water%20Kung%20Fu"
    },
    {
      "name": "Dragon Breath",
      "price_money": 1500000,
      "description": "Fire breath and dragon-inspired moves.",
      "sea": "Second Sea",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/3/32/Dragon_Breath.png/revision/latest/scale-to-width-down/268?cb=20220228202047",
      "id": "dragon-breath",
      "wiki_description": "Fire breath and dragon-inspired moves.",
      "page_description": "Dragon Breath is considered relatively weak by many players. However, it can be evolved to Dragon Talon, making it a lot stronger.",
      "trivia": [
        "Dragon Breath is the cheapest fighting style that costs Fragments  .\nDragon Breath is also the only fighting style that does not require Money   to purchase.",
        "Dragon Breath is also the only fighting style that does not require Money   to purchase.",
        "Usually, when equipping a fighting style, the system message displays: 'Bought <Fighting Style> for   0 and  0'. However, when equipping Dragon Breath, the message instead reads: 'Activated <Dragon Breath>.'"
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Dragon%20Breath"
    },
    {
      "name": "Superhuman",
      "price_money": 3000000,
      "description": "Combination of basic styles for super speed.",
      "sea": "Second Sea",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/a/ad/Superhuman.png/revision/latest/scale-to-width-down/268?cb=20220228215748",
      "id": "superhuman",
      "wiki_description": "Combination of basic styles for super speed.",
      "page_description": "Superhuman is a long-standing fighting style in PvP due to its simple and agile moves. Because of its flexible mobility, this fighting style was extremely popular. Now, it's less popular because of the newer and better fighting styles such as Dragon Talon, Electric Claw, and its successor, Godhuman. This can still be used to practice skills. This fighting style is mostly used in skilled builds.",
      "trivia": [
        "If the user hits an NPC using [C] Conqueror Gun on the hot side of Hot and Cold, the user will take damage because of the lava underneath.",
        "Superhuman is used by the Living Zombies at Haunted Castle, but they only utilize M1s (left clicks) and not the moves.",
        "Even though Superhuman is the most expensive V1 fighting style, and others are better due to factors such as damage or range, this still is a decent fighting style to use.",
        "Superhuman is said to be Combat's successor, although it was proven false after the announcement of \"Superhuman V2\" (Godhuman) by rip_indra.",
        "Superhuman is basically a weaker version of Godhuman because both fighting styles have similar moves with Superhuman. This fighting style simply has older, more outdated design, slightly lower damage and [X] Thunder Clap not containing two variants compared to its successor, Godhuman.",
        "Superhuman can be good for grinding aura since [Z] Beast Owl Pounce deals a decent amount of hits.",
        "Superhuman is the fighting style with the second highest mastery requiring obtainment, with all other fighting styles (except Godhuman) being tied to each other in the mastery requirements.",
        "Superhuman isn't very good for grinding or PvP compared to the V2s, so it is recommended to use a different fighting style, such as its upgraded version, Godhuman.",
        "This is (sometimes) regarded as the 'most skilled fighting style' in the game."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Superhuman"
    },
    {
      "name": "Death Step",
      "price_money": 2500000,
      "description": "Advanced Dark Step with death themes.",
      "sea": "Third Sea",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/8/89/Death_Step.png/revision/latest/scale-to-width-down/268?cb=20220228233624",
      "id": "death-step",
      "wiki_description": "Advanced Dark Step with death themes.",
      "page_description": "Death Step is the upgraded version of Dark Step, making it significantly more powerful in many aspects. While this Fighting Style is equipped, Aura stages are based on the user's legs instead of their arms while activated. This is entirely visual and provides no buffs apart from regular Aura buffs.",
      "trivia": [
        "Death Step and its inferior version Dark Step are the only current fighting styles in the whole game that have a transformation-type move that enhances damage, as well as the only ones that have four moves.",
        "There is a bug where if [V] Maximum Overheat is active while switching fighting styles, the visual effect on the user's feet will stay until the user dies or leaves the game. This also applies to Dark Step. Keep in mind that this is purely visual effect, and does not provide any buffs.",
        "When using [Z] Rocket Kick on the edges of the volcano at the Magma Village, the crater created will be purple, similar to T-Rex's [F] move.",
        "The [V] ability Maximum Overheat has the highest mastery required for a move in the whole game, being 400 mastery, with other [V] moves usually having mastery requirements of 150, 225, 250, 300, 350 mastery. However, Maximum Overheat before Update 14 used to have a mastery requirement of 450.",
        "Before Update 14, Death Step's [V] was one of the most tedious things to get in the game, with things like Godhuman, Sanguine Art, Race Awakenings and others, did not exist at the time, so getting this move was one of the most tedious things to do at the time, similar to getting max level, 30m Bounty/Honor, getting 600 mastery on something, owning the most expensive fruits, and others. But when Update 14 rolled around, the mastery requirement went from 450 to 400.",
        "Death Step, along with Dark Step, are the only fighting styles that have [V] abilities.",
        "Death Step's [V] move used to be called Devil Flames."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Death%20Step"
    },
    {
      "name": "Sharkman Karate",
      "price_money": 2500000,
      "description": "Advanced Water Kung Fu with shark power.",
      "sea": "Third Sea",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/b/b3/Sharkman_Karate.png/revision/latest/scale-to-width-down/268?cb=20220228233224",
      "id": "sharkman-karate",
      "wiki_description": "Advanced Water Kung Fu with shark power.",
      "page_description": "Sharkman Karate serves as an upgrade to its First Sea counterpart Water Kung Fu. It is an excellent fighting style for combos mainly because its moves are faster, easy to hit, and deal much more damage compared to Water Kung Fu, as well as most of its moves breaking instinct.",
      "trivia": [
        "Both Kilo Admiral and Fish Crew Member uses Sharkman Karate Old's M1's as its melee.",
        "Sharkman Karate is considerably the best way to grind for Aura levels, as almost all the moves are tick damage, especially [C] Great Sea Spear as it has lots of tick damage.",
        "Sharkman Karate is the second V2 Fighting Style to have an upgraded version, the first being Dragon Talon.",
        "Before Update 27.3, Sharkman Karate was obtained from Daigrock, the Sharkman.",
        "Despite being an upgrade to Water Kung Fu, Sharkman Karate currently stands as the fighting style with the worst m1s in-game, due to their overall bad hitbox and dash on 3rd M1 causing many people to hate the rework. It is recommended to use Sharkman Karate solely for pvp, and Water Kung Fu for grinding.",
        "Currently, the Sharkman Master's final belt in the Fish slap battle training is excruciatingly hard, as it requires a 100% critical hit ratio, and getting lucky so the Sharkman Master misses his final hit."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Sharkman%20Karate"
    },
    {
      "name": "Electric Claw",
      "price_money": 3000000,
      "description": "Advanced Electric with claw attacks.",
      "sea": "Third Sea",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/0/00/Electric_Claw.png/revision/latest/scale-to-width-down/268?cb=20220228215956",
      "id": "electric-claw",
      "wiki_description": "Advanced Electric with claw attacks.",
      "page_description": "Electric Claw serves as an upgraded version to its predecessor, Electric. It is mainly used for PvP due to its quick speed and moderately easy-to-hit, powerful, and stunning skills. Although it is highly not recommended for aerial PvP, since its moves are mainly on the ground.",
      "trivia": [
        "Somehow, the damage dealt to Sea Beasts with [Z] Electric Rampage is measly. (Probably because only the final slashes are counted as physical attacks, and it deals most of damage)",
        "The player can use Flash Step while triggering [Z] Electric Rampage or [C] Thunderclap and Flash (only for mobile users) by pressing Flash Step first, then pressing \"Use\" [C] Thunderclap and Flash. This can be used for surprising enemies.",
        "Players can turn Electric Claw's M1's to something useful. Using an auto clicker and setting the click interval to one millisecond, players can glide because the M1's of this fighting style has a short dash. This is similar to Dragon Talon.",
        "If the player turns on the damage counter before using [X] Lightning Thrust, the damage counter will say 0 damage before it creates the explosion.",
        "If [X] Lightning Thrust is held down long enough, (approximately 30 seconds) the electrical effects and sound will stop but nothing else changes.",
        "[X] Lightning Thrust can sometimes launch the user very far away if they have a low-end PC or high ping, making it great for traveling and running.",
        "Sometimes, [X] Lightning Thrust can glitch the user under an island and into the water in raids. (Usually when their ping is high.)",
        "[C] Thunderclap and Flash sometimes glitches the user into the sea, killing them. The reason is unknown.",
        "[C] Thunderclap and Flash can glitch the user under islands like Tiki Outpost and Sea of Treats.",
        "The [X] Lighting Thrust move is the same sound as when Piranhas use their shocks.",
        "The Electric Claw is the only Fighting Style that has a model just like Guns and Swords.",
        "With enough lag, [Z] Electric Rampage cannot teleport the user."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Electric%20Claw"
    },
    {
      "name": "Dragon Talon",
      "price_money": 3000000,
      "description": "Advanced Dragon Breath with talon strikes.",
      "sea": "Third Sea",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/e/e9/Dragon_Talon.png/revision/latest/scale-to-width-down/268?cb=20220228215538",
      "id": "dragon-talon",
      "wiki_description": "Advanced Dragon Breath with talon strikes.",
      "page_description": "Dragon Talon serves as a direct upgrade from Dragon Breath, with attacks that resemble Dragon's abilities—hence the name. It focuses on close-range, high-damage, area-filled combat, utilizing burning effects and distorting the opponent’s view with violent screen shakes. However, in return, it is generally slower than most other fighting styles. Dragon Talon is mostly used for grinding or Sea Events due to its high damage and AoE moves.",
      "moves": [
        "hence the name. It focuses on close-range",
        "high-damage",
        "area-filled combat",
        "utilizing burning effects",
        "distorting the opponent’s view with violent screen shakes. However",
        "in return",
        "it is generally slower than most other fighting styles. Dragon Talon is mostly used for grinding or Sea Events due to its high damage",
        "AoE moves"
      ],
      "trivia": [
        "Dragon Talon is the fighting style with the highest M1 damage in the game.",
        "The sound of Dragon Talon's [Z] move when it misses is the same as the sound of the Yama [Z] move when it misses.",
        "Dragon Talon's M1 sound effects originated from Dragon Breath's fire-based M1s, it being a predecessor to this fighting style.",
        "Many people think Dragon Talon's [Z] move is the only move in the game with a finisher variant, although this is actually wrong. Shadow's [C] Nightmare Leech also has a finisher variant, and the reason people don't notice is because the finisher only slightly changes the move.",
        "The finisher variant of [Z] Talon Lighter is a guaranteed kill—bypassing all forms of resurrection (like Ghost's and Pain's Resurrection passives, but also Friendly PvP's revive), defense (like Shark V3 and Cyborg V3), healing (like Phoenix's [X] and Angel V3), and instinct-tricking.",
        "Dragon Talon's M1s release a mark that looks like a dragon's footprint.",
        "When the user uses [Z] Talon Lighter, they will see a faint image of a dragon head as they dash.",
        "When the user uses [X]Ember Annihilation at a thin wall like the Ice Castle's wall, they will have a slight chance of phasing through the wall.",
        "[C] Infernal Vortex resembles Transformed Eastern Dragon's [X], as the user holds the enemy in place, jumps up, then slams down with devastating force.",
        "Dragon Talon is the first V2 Fighting Style to be able to be upgraded, followed by Sharkman Karate."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Dragon%20Talon"
    },
    {
      "name": "Godhuman",
      "price_money": 5000000,
      "description": "Ultimate fighting style combining all.",
      "sea": "Third Sea",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/4/41/Godhuman.png/revision/latest/scale-to-width-down/268?cb=20220913103851",
      "id": "godhuman",
      "wiki_description": "Ultimate fighting style combining all.",
      "page_description": "Godhuman is one of the best fighting styles in PvP due to its impressive speed, damage, knockback, and stun. However, it is not ideal for grinding because of its slow [M1] attack speed and lack of effective AoE moves. Additionally, its knockback is a disadvantage when grinding, as it makes grouping enemies more difficult.",
      "trivia": [
        "Godhuman costs   5,000,000,   5,000, and will cost   20,400,000,   26,500 and 3,600 combined masteries from 400 each on all Fighting Styles except Combat and Sanguine Art.",
        "Godhuman is the only fighting style to have 2 moves with tap/held variants, with them being [X] Heaven and Earth and [C] Sixth Realm Gun.",
        "Godhuman is considered the most tedious Fighting Style to obtain to most players, due to it requiring almost every fighting style in the game at 400 mastery along with the hard-to-obtain materials.",
        "Godhuman's [TAP] Normal Attack leaves a rainbow trail for a split second, just like how Instinct V2 leaves a trail when enabled.",
        "Like Superhuman, the M1s make a shockwave of compressed air and have a small trail behind when used, Godhuman's being more prominent.",
        "[Z] Soaring Beast and [C] Sixth Realm Gun will cause the player to take water damage if their target is below water, so be wary. (Unless the player is using the Shark race or the user is not using a Blox Fruit.)",
        "[Z] Soaring Beast and [C] Sixth Realm Gun can allow the player to grab an enemy through a thin wall if their target is close to the wall.",
        "Godhuman is commonly abbreviated as 'GH'.",
        "Godhuman is a very versatile and popular fighting style for bounty hunting, and many people use it.",
        "Godhuman's [Z] Soaring Beast and [C] Sixth Realm Gun tap variants (as Godhuman's [C] Sixth Realm Gun (held) breaks Instinct) themselves are easily \"instinct-trickable\". It is recommended to use an ability to break or wear off Instinct beforehand, like Cyborg's V3 or Godhuman's [X] Heaven and Earth."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Godhuman"
    },
    {
      "name": "Sanguine Art",
      "price_money": 5000000,
      "description": "Blood-based attacks with lifesteal.",
      "sea": "Third Sea",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/8/83/Sanguine_Art.png/revision/latest/scale-to-width-down/268?cb=20231025151119",
      "id": "sanguine-art",
      "wiki_description": "Blood-based attacks with lifesteal.",
      "page_description": "Sanguine Art's life leech, decently easy-to-hit moves, and immense combo potential make it one of the best fighting styles for general use, with its main competitors being Godhuman, Electric Claw, and Dragon Talon.",
      "trivia": [
        "The first part of the name \"Sanguine Art\" comes from the Latin word for blood, sanguis.",
        "Sanguine Art is the first fighting style to have a life-stealing move. ([Z] move - Bloodbane Drain)\nLikewise, the bats can damage large objects (Such as Sea Beasts), but it does not restore the user's health or grab.\nAdditionally, this move features aim assist that enables the user to grab enemies within the attack path directly ahead, provided they are at a close enough distance. This effectively extends the range for grabbing enemies to approximately 1.6 times farther along the straight line in front of the move.",
        "Likewise, the bats can damage large objects (Such as Sea Beasts), but it does not restore the user's health or grab.",
        "Additionally, this move features aim assist that enables the user to grab enemies within the attack path directly ahead, provided they are at a close enough distance. This effectively extends the range for grabbing enemies to approximately 1.6 times farther along the straight line in front of the move.",
        "The [C] move is a multi-target move, meaning it can grab multiple targets at the same time if directly used.\nEven if it misses, it can still track multiple enemies.",
        "Even if it misses, it can still track multiple enemies.",
        "Sanguine Art is the fighting style with the fastest M1 speed.",
        "Sanguine Art is the fighting style with the highest [C] move damage in the game.",
        "The player is not required to have mastery on any other fighting style to learn Sanguine Art. It is possible to learn even if the user is still using Combat.",
        "Haunted Crew Member and the Red Commander the only enemy in the game that uses this fighting style",
        "If combining Skull Guitar's [X] move, Ghoul Mask, Ghoul V4 Blood Siphon (tier 2), night time, and using the [Z] move, the player's life-leech can reach ~47-50%.",
        "Sanguine Art, alongside Combat, are the only fighting styles without an upgraded version of them.",
        "If the player has a Leviathan Heart and interact with Shafi, their materials (if they have them) will be consumed automatically, even if they didn't wish to.",
        "There is a glitch where after using [C] Devourer of Worlds, the user will be stuck in the move stance. This can be undone by using the [C] move again."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Sanguine%20Art"
    }
  ],
  "swords": [
    {
      "name": "Katana",
      "rarity": "Common",
      "price_money": 1000,
      "description": "Basic steel katana for beginners. Abilities: Quiet Rush, Air Slash.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/e/e9/Katana.png/revision/latest/scale-to-width-down/268?cb=20241223061522",
      "id": "katana",
      "wiki_description": "Basic steel katana for beginners. Abilities: Quiet Rush, Air Slash.",
      "page_description": "The Katana can be purchased for   1,000 from the Sword Dealer.",
      "trivia": [
        "The Katana used to have a price of   5,000 instead of   1,000.",
        "The Katana is functionally identical to the Cutlass, sharing the same moveset, damage values, and cooldowns even though granted, they are different swords. The only distinction between the two weapons is their model design.",
        "The Katana and Cutlass are the first obtainable swords a normal player can get.",
        "The Katana has a bug, when you use [Z] Quiet Rush and quickly unequip it, it wil cause the user being in a weird animation."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Katana"
    },
    {
      "name": "Cutlass",
      "rarity": "Common",
      "price_money": 1000,
      "description": "Short, curved sword for sailors. Abilities: Quiet Rush, Air Slash.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/1/1e/Cutlass.png/revision/latest/scale-to-width-down/268?cb=20241223061505",
      "id": "cutlass",
      "wiki_description": "Short, curved sword for sailors. Abilities: Quiet Rush, Air Slash.",
      "page_description": "The Cutlass can be purchased for   1,000 from the Sword Dealer.",
      "trivia": [
        "The Cutlass has the same move set as the Katana.",
        "The Cutlass used to cost   5,000 instead of   1,000.",
        "Chef and many other enemies use the Cutlass.",
        "Prior to Chef using the Cutlass, Bobby used to use it. Chef replaced Bobby as of Update 26.",
        "The Cutlass also appears as the 2x Mastery icon in the shop."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Cutlass"
    },
    {
      "name": "Dual Katana",
      "rarity": "Common",
      "price_money": 12000,
      "description": "Dual-wield katanas for fast slashes. Abilities: Cyclone Slash, Double Air Slash.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/9/90/Dual_Katana.png/revision/latest/scale-to-width-down/268?cb=20241223061511",
      "id": "dual-katana",
      "wiki_description": "Dual-wield katanas for fast slashes. Abilities: Cyclone Slash, Double Air Slash.",
      "page_description": "The Dual Katana is a Common sword.",
      "trivia": [
        "The Dual Katana is often preferred over the Iron Mace because of its wider area of effect, making it more effective against multiple enemies."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Dual%20Katana"
    },
    {
      "name": "Iron Mace",
      "rarity": "Common",
      "price_money": 25000,
      "description": "Heavy mace for crushing attacks. Abilities: Crush, Ground Slam.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/e/ee/Iron_Mace.png/revision/latest?cb=20241223032617",
      "id": "iron-mace",
      "wiki_description": "Heavy mace for crushing attacks. Abilities: Crush, Ground Slam.",
      "page_description": "The Iron Mace is an Uncommon sword.",
      "trivia": [
        "The Iron Mace is the only sword that has visible spikes on it.",
        "When the player holds [X] Killer Combo then rapidly unequips the Iron Mace right before the move finishes its animation, they will be rendered immobile until the player resets or leaves the game. This glitch can be useful for AFK grinding enemies by preventing the player from moving or perhaps taking knockback from attacks. (This can prove useful for lower leveled players with Elemental fruits, but doesn't really help that much with general grinding.)",
        "The Iron Mace, despite being classified as a sword, is a Mace.",
        "The Iron Mace, alongside Shark Saw and Bisento are the only swords that slam on the ground on the last M1."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Iron%20Mace"
    },
    {
      "name": "Shark Saw",
      "rarity": "Uncommon",
      "price_money": 30000,
      "description": "Serrated blade from shark teeth. Abilities: Shark Bite, Frenzy Slash.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/e/ea/Shark_Saw.png/revision/latest?cb=20241223032633",
      "id": "shark-saw",
      "wiki_description": "Serrated blade from shark teeth. Abilities: Shark Bite, Frenzy Slash.",
      "page_description": "The Shark Saw is an Uncommon sword.",
      "trivia": [
        "The Shark Saw, alongside Iron Mace and Bisento are the only swords that slam on the ground on the last M1.",
        "Fishman Raiders use the Shark Saw with the old version of [X] Execution."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Shark%20Saw"
    },
    {
      "name": "Triple Katana",
      "rarity": "Common",
      "price_money": 60000,
      "description": "Three katanas for versatile attacks. Abilities: Triple Slash, Spinning Blades.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/3/34/Triple_Katana.png/revision/latest/scale-to-width-down/268?cb=20241223061548",
      "id": "triple-katana",
      "wiki_description": "Three katanas for versatile attacks. Abilities: Triple Slash, Spinning Blades.",
      "page_description": "The Triple Katana is an Uncommon sword.",
      "trivia": [
        "The Vice Admiral, Fishman Commandos, Marine Captains, and Cake Guards use the Triple Katana as their weapon.",
        "The Triple Katana is one of the only three Swords in the game that have three Swords combined to form one. (Triple Katana, True Triple Katana and Triple Dark Blade)."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Triple%20Katana"
    },
    {
      "name": "Dual-Headed Blade",
      "rarity": "Common",
      "price_money": 40000,
      "description": "Double-ended blade for unique combos. Abilities: Double Slash, Spinning Strike.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/6/69/Dual-Headed_Blade.png/revision/latest?cb=20241223032343",
      "id": "dual-headed-blade",
      "wiki_description": "Double-ended blade for unique combos. Abilities: Double Slash, Spinning Strike.",
      "page_description": "The Dual-Headed Blade is a Rare sword.",
      "trivia": [
        "In the moveset, the Dual-Headed Blade is called \"Headed Blade\" (due to the lack of wording space).",
        "The X move appears to be an upgraded version of the Wardens Sword X move.",
        "The Dual-Headed Blade is the third most expensive sword in the First Sea behind Soul Cane and Bisento."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Dual-Headed%20Blade"
    },
    {
      "name": "Pipe",
      "rarity": "Common",
      "price_money": 100000,
      "description": "Metal pipe for blunt attacks. Abilities: Pipe Smash, Heavy Swing.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/b/b9/Pipe.png/revision/latest?cb=20241223032506",
      "id": "pipe",
      "wiki_description": "Metal pipe for blunt attacks. Abilities: Pipe Smash, Heavy Swing.",
      "page_description": "The Pipe can be bought at the cost of   100,000 from the Sword Dealer of the East, who is located at the Frozen Village in the First Sea.",
      "trivia": [
        "Even though the Pipe is a sword, its shape and name have no sword-like characteristics at all.",
        "[X] Earth Smash (old move) was similar to Iron Mace's [X] ability.",
        "The Pipe's model prior to Update 24 was an actual pipe. The name for the weapon after the update had remained unchanged which makes the item description make no sense, despite its updated appearance. This can be confusing for new players who are unfamiliar with the old Pipe model."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Pipe"
    },
    {
      "name": "Soul Cane",
      "rarity": "Rare",
      "price_money": 750000,
      "description": "Mystic cane harnessing souls. Abilities: Soul Beam, Soul Slash.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/4/40/Soul_Cane.png/revision/latest?cb=20241223032659",
      "id": "soul-cane",
      "wiki_description": "Mystic cane harnessing souls. Abilities: Soul Beam, Soul Slash.",
      "page_description": "The Soul Cane can be bought for   750,000 from the Living Skeleton. It is recommended to use Fast Mode due to the entrance being hard to spot.",
      "trivia": [
        "The Soul Cane is well known because of its combo potential and good stuns. However, it is hard to use due to small hitboxes, which is why this sword is mostly seen in skill builds, usually paired with Acidum Rifle and others.",
        "Even though it is thought to be for low level players, it is still good in PvP.",
        "The Soul Cane is the second most expensive sword in the First Sea, the first being Bisento.",
        "The way Soul Cane is held is known as the \"reverse grip\" (in real life combat), which is often not practiced due to the technique lacking range, protection and power in ranged combat.",
        "The way soul cane is held is the exact same as the Gravity Blade."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Soul%20Cane"
    },
    {
      "name": "Trident",
      "rarity": "Common",
      "price_money": 20000,
      "description": "Long spear for piercing attacks. Abilities: Pierce, Trident Throw.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/9/9a/Trident.png/revision/latest?cb=20241223032713",
      "id": "trident",
      "wiki_description": "Long spear for piercing attacks. Abilities: Pierce, Trident Throw.",
      "page_description": "The Trident can be obtained after defeating the Fishman Lord.",
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Trident"
    },
    {
      "name": "Warden Sword",
      "rarity": "Common",
      "price_money": 25000,
      "description": "Balanced sword for PvE. Abilities: Warden Slash, Guard Break.",
      "image_url": "https://raw.githubusercontent.com/natsu5097/bloxgrox/main/images/swords/warden_sword.png",
      "id": "warden-sword",
      "wiki_description": "Balanced sword for PvE. Abilities: Warden Slash, Guard Break.",
      "page_description": "Redirect to:",
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Warden%20Sword"
    },
    {
      "name": "Bisento",
      "rarity": "Rare",
      "price_money": 1000000,
      "description": "Large pole weapon for sweeping attacks. Abilities: Quake Smash, Tornado Slash.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/3/31/Bisento.png/revision/latest?cb=20241223032227",
      "id": "bisento",
      "wiki_description": "Large pole weapon for sweeping attacks. Abilities: Quake Smash, Tornado Slash.",
      "page_description": "To obtain the Bisento, the player must buy it from the Master Sword Dealer, who is located on the fourth island at Skylands. The player can buy this sword for   1,000,000 only if the player is at least Lv. 250.",
      "trivia": [
        "Bisento has one of Quake's old abilities (Quake Sphere) as one of its moves.",
        "This sword has the second highest damage per click in the game. (The first being Triple Dark Blade and third is True Triple Katana.)",
        "Bisento, Dark Blade, Katana, and Cutlass received an animation update in Update 17.2.",
        "Bisento is the most expensive sword in the First Sea.",
        "Bisento, Dark Blade, Saber, and Pole are the only four swords to have a V2.",
        "Before Update 24, if the player activated an auto-clicker right as the impact effect appeared, there was a chance the sword would have double its range.",
        "Bisento V2’s [Z] move is similar to Mammoth [Z] but smaller.",
        "For some reason, the fourth M1 doesn't work in Buddha transformation."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Bisento"
    },
    {
      "name": "Pole (1st Form)",
      "rarity": "Rare",
      "price_money": 5000,
      "description": "Staff weapon with electric charge. Abilities: Thunder Strike, Pole Vault.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/b/b0/Pole_%281st_Form%29.png/revision/latest?cb=20241223032519",
      "id": "pole-1st-form",
      "wiki_description": "Staff weapon with electric charge. Abilities: Thunder Strike, Pole Vault.",
      "page_description": "The Pole (1st Form) is a Legendary sword.",
      "trivia": [
        "The Pole (1st Form) can be upgraded to its second form (Pole (2nd Form)) by getting struck by a lightning in Rough Sea while holding Pole (1st Form).",
        "The inventory description states the Sword is blunt, but due to the revamped model, it appears sharp, like a spear."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Pole%20(1st%20Form)"
    },
    {
      "name": "Saber",
      "rarity": "Rare",
      "price_money": 0,
      "description": "Dropped by Saber Expert; upgradable. Abilities: Flying Slash, Triple Slash.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/2/23/Saber.png/revision/latest?cb=20241223032603",
      "id": "saber",
      "wiki_description": "Dropped by Saber Expert; upgradable. Abilities: Flying Slash, Triple Slash.",
      "page_description": "The Saber is a Legendary sword.",
      "trivia": [
        "While the Saber can be great for PvP, it can only really work if the opponent is not using Instinct. Since this sword does not have any abilities that break Instinct, it is suggested to have another weapon equipped that can break Instinct easily.",
        "It is recommended to bounty hunt with Ice or Dark along with the Saber, as the player can pull enemies with Dark's [X] ability to the critical [Z] ability range.",
        "The player should aim accurately to deal a critical hit on their opponent. (V2)\nIt is possible to do a one-shot combo using just the Last Resort ability along with the [Z] and [X] abilities, if done right.",
        "It is possible to do a one-shot combo using just the Last Resort ability along with the [Z] and [X] abilities, if done right.",
        "Due to its incredible damage, the Saber V2 is still considered to be a fairly decent sword in PvP in the Second Sea. However, it is recommended that the player upgrades to a better sword as they progress out of the Second Sea and enter the Third Sea.",
        "The Saber is one of the best swords the player can obtain in the First Sea.",
        "The Saber is one of the best swords for grinding, as its M1 deals high damage, with little to no knockback, and has a low cooldown.",
        "The Saber's handguard model cuts into the hilt.",
        "[Z] Deadly Rush is a good combo extender so always try to combo with that (for low level).",
        "The Saber has the fastest one-shot combo, being one second to eliminate an enemy if pairing it with Godhuman and Portal, and using the right combo.",
        "The Saber is required to obtain Instinct.",
        "Saber Expert uses the old moves of Saber.",
        "The [Z] Deadly Rush ability (V1 or V2) can be used to go through thin walls, such as the igloos at the cold side of Hot and Cold. The user needs to get close to the igloo entrance, but don't touch the wall, then use the [Z] Deadly Rush ability forwards to the wall.",
        "The Saber, along with Bisento, Dark Blade and Pole (1st Form) are the only swords with a V2."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Saber"
    },
    {
      "name": "Dragon Trident",
      "rarity": "Rare",
      "price_money": 750000,
      "description": "Fire-based trident with range. Abilities: Dragon Pierce, Flame Burst.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/0/09/Dragon_Trident.png/revision/latest?cb=20241223032313",
      "id": "dragon-trident",
      "wiki_description": "Fire-based trident with range. Abilities: Dragon Pierce, Flame Burst.",
      "page_description": "The Dragon Trident is a Rare sword.",
      "trivia": [
        "If the player uses the Dragon Trident's [M1] dash attack in mid-air, they will go very far.",
        "The Tide Keeper uses the old abilities of Dragon Trident.",
        "The Dragon Trident is the only Rare sword to have its [X] move mastery requirement being 350."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Dragon%20Trident"
    },
    {
      "name": "Gravity Blade",
      "rarity": "Rare",
      "price_money": 0,
      "description": "Dropped by Fajita; gravity effects. Abilities: Gravity Push, Meteor Strike.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/c/c4/Gravity_Blade.png/revision/latest?cb=20241223032412",
      "id": "gravity-blade",
      "wiki_description": "Dropped by Fajita; gravity effects. Abilities: Gravity Push, Meteor Strike.",
      "page_description": "The Gravity Blade (formerly known as Gravity Cane) is a Rare sword.",
      "trivia": [
        "Gravity Blade is based on the Chokutō, which is a traditional Japanese sword.\nIn real life, the way this sword is held is known as the \"reverse grip\". While this grip reduces the power and precision of attacks, it allows for quicker and less predictable movements in close quarters, making it ideal for surprise strikes.",
        "In real life, the way this sword is held is known as the \"reverse grip\". While this grip reduces the power and precision of attacks, it allows for quicker and less predictable movements in close quarters, making it ideal for surprise strikes.",
        "[X] Lunar Blitz is quite similar to Awakened Dough's grounded [X] Pastry River, with both sharing a lift-and-drop mechanic.",
        "Gravity Blade's old [Z] (Gravity Push) was identical to Gravity's old [Z], with both sharing names, VFX and move purpose. (Other than the direction of the move.)",
        "Gravity Blade's old moves were similar to Orbitus' moves with the [Z] being the same as one of his moves and the [X] being a shorter version of his other move."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Gravity%20Blade"
    },
    {
      "name": "Flail",
      "rarity": "Rare",
      "price_money": 0,
      "description": "Dropped by bosses; chain-based. Abilities: Chain Whip, Spiked Slam.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/1/1d/Flail.png/revision/latest?cb=20241223032358",
      "id": "flail",
      "wiki_description": "Dropped by bosses; chain-based. Abilities: Chain Whip, Spiked Slam.",
      "page_description": "The Flail (formerly known as Jitte) is a Rare sword.",
      "trivia": [
        "The Flail is used by the Lv. 1150 Boss, Smoke Admiral and a Lv. 2600 Raid Boss, Tyrant of the Skies.",
        "The Flail is the only weapon used by two bosses, but only dropped by one.",
        "A special glitch can be done with the Flail to make it look like the player is using /opfun, an admin command which allows a player to spam abilities even when they are still doing the ability. (Maybe patched)",
        "Flail is not a typical sword but actually a spin-off of Morning Star, it was typically used by the cavalry in the medieval times."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Flail"
    },
    {
      "name": "Longsword",
      "rarity": "Rare",
      "price_money": 0,
      "description": "Dropped by bosses; long reach. Abilities: Long Slash, Piercing Thrust.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/3/34/Longsword.png/revision/latest?cb=20241223032424",
      "id": "longsword",
      "wiki_description": "Dropped by bosses; long reach. Abilities: Long Slash, Piercing Thrust.",
      "page_description": "The Longsword can be obtained after defeating the Diamond boss.",
      "trivia": [
        "Despite the description saying that the Longsword has a hexagonal cross-section, the older model used to look like a pentagon."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Longsword"
    },
    {
      "name": "Koko",
      "rarity": "Legendary",
      "price_money": 2000000,
      "description": "Buffed by Control fruit; high AoE. Abilities: Electric Slash, Thunderous Strike.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/f/f0/Koko.png/revision/latest/scale-to-width-down/268?cb=20241223061527",
      "id": "koko",
      "wiki_description": "Buffed by Control fruit; high AoE. Abilities: Electric Slash, Thunderous Strike.",
      "page_description": "Koko can be dropped after defeating Order.",
      "trivia": [
        "Koko isn’t seen much in builds, but it’s actually a really good sword for hybrids. Especially when paired with Control, where it gets heavily buffed, making it a versatile option.",
        "Koko is used by the Lv. 1250 raid boss, Order.",
        "Both moves deal the exact same damage.",
        "Despite being called a katana, Koko itself is an ōdachi, which is longer and larger than a normal katana.",
        "[Z] Electric Stab can be used to no-clip through thin walls and doors.",
        "Koko is the first sword to be buffed by a fruit other than Buddha, which is Control.",
        "The hitbox of [X] Injection Shot is at the player's cursor, not the visual, meaning if the player moves the cursor to somewhere else, then the move's hitbox will move as well. For instance, if the player first aimed the [X] Injection Shot in front of themselves but aimed to the right after releasing the move, the target(s) to the right will be affected. (Does not work if the player held the move instead of tapping the move.)",
        "Koko is not curved like a normal ōdachi, instead it is straight. This suggests that after forging koko was not drenched in water, rather it was left to cool off, which ideally would result in a weaker katana."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Koko"
    },
    {
      "name": "Midnight Blade",
      "rarity": "Legendary",
      "price_money": 0,
      "description": "Dropped by El Admin; night-themed. Abilities: Night Slash, Shadow Strike.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/b/bf/Midnight_Blade.png/revision/latest?cb=20241223032439",
      "id": "midnight-blade",
      "wiki_description": "Dropped by El Admin; night-themed. Abilities: Night Slash, Shadow Strike.",
      "page_description": "The Midnight Blade is a Legendary sword.",
      "trivia": [
        "The old version of the Midnight Blade is used by the Lv. 1325 Raid Boss, Cursed Captain.",
        "The afterimage that the [Z] move creates holds the unreleased redesign of the Midnight Blade."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Midnight%20Blade"
    },
    {
      "name": "Rengoku",
      "rarity": "Legendary",
      "price_money": 2000000,
      "description": "Fiery blade with blazing strikes. Abilities: Burning Slash, Flame Burst.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/7/7d/Rengoku.png/revision/latest?cb=20241223032548",
      "id": "rengoku",
      "wiki_description": "Fiery blade with blazing strikes. Abilities: Burning Slash, Flame Burst.",
      "page_description": "Rengoku can be obtained by using the Hidden Key to unlock a chest at the Ice Castle, located in the Second Sea. The chest is hidden under the staircase, right below the Awakened Ice Admiral, the entrance of which can be found to the right.",
      "trivia": [
        "Rengoku is an easter egg that the devs added at Update 13.",
        "Before the rework in Update 20, the [Z] move did not do burn damage.",
        "Rengoku's moveset post-rework is similar to the Pipe."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Rengoku"
    },
    {
      "name": "Saishi",
      "rarity": "Legendary",
      "price_money": 2000000,
      "description": "Legendary sword from Dealer; gold-infused. Abilities: Swords Dance, True Air Slash.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/f/f7/Saishi.png/revision/latest?cb=20241223032618",
      "id": "saishi",
      "wiki_description": "Legendary sword from Dealer; gold-infused. Abilities: Swords Dance, True Air Slash.",
      "page_description": "Saishi (formerly known as Saddi) is a Legendary sword.",
      "trivia": [
        "Saishi, along with Shizu and Oroshi are required (and with 300 mastery on each respectively) to obtain the True Triple Katana.",
        "The user can grab Besto Friendos (Love's [V] move) with [Z] Swords Dance.",
        "Saishi is debated to be the best sword in the Second Sea, with its main competitors being Rengoku, Dragon Trident, and Midnight Blade.",
        "[Z] Swords Dance will lock the user in place for a second after dealing damage to big targets such as Sea Beasts.",
        "[Z] Swords Dance and [X] True Air Slash deal the same amount of damage. (Only if [Z] is used close to the target)"
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Saishi"
    },
    {
      "name": "Shizu",
      "rarity": "Legendary",
      "price_money": 2000000,
      "description": "Legendary sword from Dealer; agile strikes. Abilities: Wind Slash, Cyclone Strike.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/4/48/Shizu.png/revision/latest?cb=20241223032646",
      "id": "shizu",
      "wiki_description": "Legendary sword from Dealer; agile strikes. Abilities: Wind Slash, Cyclone Strike.",
      "page_description": "Shizu (formerly known as Shisui) is a Legendary sword.",
      "trivia": [
        "Although Shizu is considered out meta by the community because of its bad hitbox and does not break Instinct, its combos are still extremely fast and the sword itself deals good damage.",
        "Shizu, along with Oroshi and Saishi are required (and with 300 mastery on each respectively) to obtain the True Triple Katana.",
        "Shizu is much like Canvander or Koko.\nMany people refer to Shizu as an improved version of Cutlass and Katana.",
        "Many people refer to Shizu as an improved version of Cutlass and Katana."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Shizu"
    },
    {
      "name": "Oroshi",
      "rarity": "Legendary",
      "price_money": 2000000,
      "description": "Legendary sword from Dealer; precise. Abilities: Swift Slash, Storm Blade.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/7/72/Oroshi.png/revision/latest?cb=20250603090340",
      "id": "oroshi",
      "wiki_description": "Legendary sword from Dealer; precise. Abilities: Swift Slash, Storm Blade.",
      "page_description": "Oroshi (formerly known as Wando) is a Legendary sword.",
      "trivia": [
        "Oroshi, along with Shizu and Saishi are required (and with 300 mastery on each respectively) to obtain the True Triple Katana.",
        "Oroshi's pre-rework [X] move (Scatter Shot) was much similar to that of pre-rework Bisento's.",
        "Oroshi is often used in skilled builds, together with Bizarre Revolver and Rumble.",
        "[Z] Continuous Slashing is similar to both Spin's and Dark Blade's [Z] moves, although it is smaller and lasts longer.\n[Z] Continuous Slashing had a larger hitbox before it was reworked.",
        "[Z] Continuous Slashing had a larger hitbox before it was reworked."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Oroshi"
    },
    {
      "name": "Tushita",
      "rarity": "Legendary",
      "price_money": 0,
      "description": "Dropped by Longma; celestial power. Abilities: Heavenly Slash, Starfall.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/0/0e/Tushita.png/revision/latest?cb=20241223032742",
      "id": "tushita",
      "wiki_description": "Dropped by Longma; celestial power. Abilities: Heavenly Slash, Starfall.",
      "page_description": "Getting both Tushita and Yama to 350 mastery and being Lv. 2200 or higher will grant the player access to do the Cursed Dual Katana puzzle and allow them obtain Cursed Dual Katana once they have completed the puzzle.",
      "trivia": [
        "Tushita is named after Tusita, one of the six deva-worlds of the Desire Realm in Buddhism.",
        "\"Tushita\" cannot be said in Roblox chat. This is due to it having a swear word in it. This means that the player has to say an alternative such as \"tusita\"."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Tushita"
    },
    {
      "name": "Yama",
      "rarity": "Legendary",
      "price_money": 0,
      "description": "Dropped by bosses; shockwave attacks. Abilities: Hell Slash, Demon Cut.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/b/ba/Yama.png/revision/latest?cb=20241223032812",
      "id": "yama",
      "wiki_description": "Dropped by bosses; shockwave attacks. Abilities: Hell Slash, Demon Cut.",
      "page_description": "Yama is an excellent support sword in PvP. Its [Z] Hellish Slash can be used to ragdoll the user when performing the Skull Guitar boosting glitch, providing amazing mobility, especially when paired with Kitsune. Its [X] Infernal Hurricane has a good enough range to be useful in combos to connect to a projectile move, such as Kitsune's [C] Fox Fire Disruption.",
      "trivia": [
        "In Buddhism, Yama is the King of Hell, named after Yāma — the third of the six heavenly worlds in the desire realm.\nThe sword could also be named after the Yamadharma Raja (Yama in short), the god of death and justice in Hindu mythology.",
        "The sword could also be named after the Yamadharma Raja (Yama in short), the god of death and justice in Hindu mythology.",
        "Yama is one of the two cursed katanas, the other being Tushita. Together, they are capable of making the Cursed Dual Katana.",
        "There is no level requirement to get Yama, unlike Tushita. However, the player will still need to be at least Lv. 1500 in order to get into the Third Sea, where it can be obtained.",
        "It is recommended to grind Elite Pirates on a private server or server hop for them. This is because in public servers Elite Pirates can be easily killed before the player comes to their place by other players or some hackers because some scripts have the option “auto-farm elite.”",
        "The player does not lose their Elite Hunter's progress upon failure to pull out Yama.",
        "[Z] Hellish Slash can be used to glitch through walls.\nExample: Using this move while aiming for the entrance of King Toad's House next to Awakenings Expert (in Second Sea) will glitch the user into the room.",
        "Example: Using this move while aiming for the entrance of King Toad's House next to Awakenings Expert (in Second Sea) will glitch the user into the room.",
        "When [X] Infernal Hurricane is used on top of the stairs that the Aura Editor is on, the user will glitch into an empty area.",
        "Yama [X] can cause other players to get flung if they use a momentum skill into it."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Yama"
    },
    {
      "name": "True Triple Katana",
      "rarity": "Mythical",
      "price_money": 8000000,
      "description": "Combines Saishi, Shizu, Oroshi; high damage. Abilities: Wolf Fang Rush, Dragon Hurricane.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/b/b2/True_Triple_Katana.png/revision/latest?cb=20241223032727",
      "id": "true-triple-katana",
      "wiki_description": "Combines Saishi, Shizu, Oroshi; high damage. Abilities: Wolf Fang Rush, Dragon Hurricane.",
      "page_description": "The True Triple Katana is a Mythical sword.",
      "trivia": [
        "The True Triple Katana is often abbreviated as \"TTK\".\nThe abbreviation \"TTK\" cannot be said in Roblox chat, mainly due to it containing a sensitive word. Instead, the player can use \"True Trip\" or other abbreviations.",
        "The abbreviation \"TTK\" cannot be said in Roblox chat, mainly due to it containing a sensitive word. Instead, the player can use \"True Trip\" or other abbreviations.",
        "If the True Triple Katana's fourth M1 is used in the air, the user would then be able to travel greater distances than the [Z] move.",
        "The True Triple Katana deals the third highest M1 damage out of every fighting style or sword in the game.",
        "If [Z] Wolf Fang Rush is used in a corner of a wall, the player has a chance to glitch through.",
        "[X] Dragon Hurricane can pull enemies much farther than the hurricane's hitboxes.",
        "[X] Dragon Hurricane can go through thin walls like the walls of the Mansion (Third Sea).",
        "This is the sword with the highest mastery-requiring obtainment.",
        "The True Triple Katana can be obtained even without finishing the Colosseum Quest, but it will be extremely difficult without the Manager's help in finding the Legendary Sword Dealer."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/True%20Triple%20Katana"
    },
    {
      "name": "Cursed Dual Katana",
      "rarity": "Mythical",
      "price_money": 0,
      "description": "Obtained via puzzle; high damage. Abilities: Revolving Ravager, Slayer of Goliath.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/7/74/Cursed_Dual_Katana.png/revision/latest?cb=20241223032242",
      "id": "cursed-dual-katana",
      "wiki_description": "Obtained via puzzle; high damage. Abilities: Revolving Ravager, Slayer of Goliath.",
      "page_description": "The Cursed Dual Katana is a Mythical sword.",
      "trivia": [
        "Cursed Dual Katana is often abbreviated as \"CDK\" by players.",
        "The Cursed Dual Katana deals the fourth highest damage per click out of every sword in the game (the third is True Triple Katana, second is Bisento V2, and the first is Triple Dark Blade).",
        "[Z] Revolving Ravager is as fast as Dark Blade's X move, but Dark Blade’s X move has more range.",
        "[X] Slayer of Goliath requires 375 Mastery, the second highest move mastery requirement in the game. Only Death Step's Maximum Overheat is higher, at 400 Mastery.\nDespite this, once a player reaches Cake Land, NPCs yield relatively more mastery, making it easier to grind past this point.",
        "Despite this, once a player reaches Cake Land, NPCs yield relatively more mastery, making it easier to grind past this point.",
        "Using Godhuman's [Z] (Soaring Beast) move while the opponent is trapped inside the tornado from Cursed Dual Katana's [Z] move will cause the move's animation to follow the opponent who is trapped inside the tornado.",
        "The Cursed Dual Katana is considered one of the best swords in the game by the community due to its versatility and attack power.",
        "The Cursed Dual Katana, along with Shark Anchor, are the only swords in the game that ignores Dragon's defense buff.",
        "A glitch that requires the player to use [X] Slayer of Goliath and immediately unequip the sword from their hotbar will freeze the target in place, rendering them unable to move until they die or switch teams. This has been patched."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Cursed%20Dual%20Katana"
    },
    {
      "name": "Dark Blade",
      "rarity": "Mythical",
      "price_money": 1200,
      "price_robux": 1200,
      "description": "Purchased or gifted; dark slashes. Abilities: One Thousand Slices, Dark Air Slash.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/a/a0/Dark_Blade.png/revision/latest/scale-to-width-down/268?cb=20241223051659",
      "id": "dark-blade",
      "wiki_description": "Purchased or gifted; dark slashes. Abilities: One Thousand Slices, Dark Air Slash.",
      "page_description": "The Dark Blade is a Mythical sword.",
      "trivia": [
        "The Dark Blade makes the user spin when they do an Air Jump or side dash. The user will also do a roll when they back dash.",
        "The Dark Blade was previously called the \"Yoru\" which was then changed to Dark Blade.",
        "There is a triple version of the Dark Blade, named the Triple Dark Blade.\nThis version is only usable by admins or people they granted it to.",
        "This version is only usable by admins or people they granted it to.",
        "The Dark Blade is the only sword that requires obtaining a Game Pass to obtain.",
        "The Dark Blade is technically the only sword that can be traded, because the player can store it in the form of a Game Pass.",
        "The Brazil Cube allowed the first player who touched it to receive Dark Blade. However, it could only be spawned in by an admin.",
        "The Dark Blade is the only sword that has an alternate skin.",
        "The Dark Blade is one of the swords that are difficult to use, due to requiring decent aiming and prediction skills.",
        "The [X] Dark Air Slash from its V1 has higher stun duration than its V2 counterpart and smaller AoE.",
        "The Dark Blade is one of the few items in the game to have its rarity altered.",
        "The Dark Blade is often abbreviated as \"DB\". Check Dictionary for more info about such abbreviations.",
        "The Dark Blade is recommended for all seas as it has high damage and low mastery requirements and are comparable to swords like Cursed Dual Katana, True Triple Katana, or Shark Anchor."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Dark%20Blade"
    },
    {
      "name": "Hallow Scythe",
      "rarity": "Mythical",
      "price_money": 0,
      "description": "Dropped by Soul Reaper; Halloween-themed. Abilities: Grim Reaper, Soul Harvest.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/c/c5/Hallow_Scythe.png/revision/latest/scale-to-width-down/268?cb=20241223061516",
      "id": "hallow-scythe",
      "wiki_description": "Dropped by Soul Reaper; Halloween-themed. Abilities: Grim Reaper, Soul Harvest.",
      "page_description": "The Hallow Scythe is a Mythical sword.",
      "trivia": [
        "The Hallow Scythe is the first sword to have a unique mechanic.\nThe less health the opponent has, the more damage the player will do with this weapon and life-leeching abilities.",
        "The less health the opponent has, the more damage the player will do with this weapon and life-leeching abilities.",
        "The Hallow Scythe was once used to kill an admin with extremely high HP. In this video, a player used a combo with Portal [C] to teleport the admin into the lava in Hot and Cold, then dragged them into it using the sword’s [Z] move, resulting in an instant kill.",
        "The engravings on the blade of the scythe mean \"Death\", while the engravings on the tang of the scythe \"風間\" can be read as Kazama in Japanese, meaning \"Between Wind\". Both the engravings combined make the word \"Death Between Wind\", alluding to Death Cyclone.",
        "The Hallow Scythe is used by the Lv. 2100 Raid Boss, Soul Reaper.",
        "The Burning blessing does not visually appear on Hallow Scythe."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Hallow%20Scythe"
    },
    {
      "name": "Fox Lamp",
      "rarity": "Mythical",
      "price_money": 0,
      "description": "Obtained via Kitsune Shrine; air-based. Abilities: Fox Fire, Ember Dash.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/f/ff/Fox_Lamp.png/revision/latest?cb=20241223051549",
      "id": "fox-lamp",
      "wiki_description": "Obtained via Kitsune Shrine; air-based. Abilities: Fox Fire, Ember Dash.",
      "page_description": "The Fox Lamp is a Legendary sword.",
      "trivia": [
        "The Fox Lamp is known for its extremely powerful high stun ability, extremely fast attacks and especially really good in the air.",
        "The Fox Lamp is more recommended for grinding by pairing it with Buddha.",
        "The Fox Lamp does not turn black when Aura is active, though Aura colors still appear. (Similar to Shark Anchor)",
        "Despite being a sword, the Fox Lamp resembles a lamp rather than a common blade.",
        "The Japanese symbols (キツネ) shown when charging [Z] Scorching Azure and [X] Infernal Firestorm (The player can briefly see the symbols as it is spun at a very fast speed), mean \"Kitsune\" which when translated means \"Fox\" in English (\"Kitsune\" can also be written as the kanji character \"狐\").",
        "The [X] move, when tapped, bears a slight resemblance to Dragon Talon's [Z] move, Talon Lighter.",
        "Fox Lamp's [M1] attacks' sound effect is similar to Dragon Breath and Dragon Talon, but with a slightly lower pitch."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Fox%20Lamp"
    }
  ],
  "guns": [
    {
      "name": "Slingshot",
      "rarity": "Common",
      "price_money": 5000,
      "description": "Basic ranged weapon that shoots pebbles. Abilities: Pebble Shot, Quick Fire.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/3/3f/Slingshot.png/revision/latest?cb=20241223023755",
      "id": "slingshot",
      "wiki_description": "Basic ranged weapon that shoots pebbles. Abilities: Pebble Shot, Quick Fire.",
      "page_description": "The Slingshot can be purchased for   5,000 from the Weapon Dealer at middle town in first sea.",
      "trivia": [
        "Slingshot is the first gun and the only Common gun in the game.",
        "Slingshot does the least amount of damage out of all the guns in the game.\nSlingshot deals lower damage than Combat.",
        "Slingshot deals lower damage than Combat.",
        "Slingshot has the lowest range out of any gun in the game.",
        "Slingshot and Rocket both cost the same price."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Slingshot"
    },
    {
      "name": "Musket",
      "rarity": "Common",
      "price_money": 15000,
      "description": "Single-shot firearm with decent range. Ability: Piercing Shot.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/2/2b/Musket.png/revision/latest?cb=20241223023710",
      "id": "musket",
      "wiki_description": "Single-shot firearm with decent range. Ability: Piercing Shot.",
      "page_description": "The Musket can be bought for   8,000 from Weapon Dealer, who is located in Middle Town, First Sea.",
      "trivia": [
        "The Pistol Billionaires in the Third Sea uses the old version of the Musket.",
        "The Musket's M1's (click) cannot be used on Chromebook, unless it is touchscreen.",
        "[Z] Draconic Bullet has similar VFX to [Z] Venomous Spit of Venom Bow."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Musket"
    },
    {
      "name": "Flintlock",
      "rarity": "Common",
      "price_money": 5000,
      "description": "Dual pistols for quickfire. Ability: Rapid Barrage.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/5/5b/Flintlock.png/revision/latest?cb=20241223023624",
      "id": "flintlock",
      "wiki_description": "Dual pistols for quickfire. Ability: Rapid Barrage.",
      "page_description": "The Flintlock is an Uncommon gun.",
      "trivia": [
        "The Flintlock's M1's (click) cannot be used on Chromebook, unless it is a touchscreen.",
        "The Flintlock's icon does not match its model."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Flintlock"
    },
    {
      "name": "Acidum Rifle",
      "rarity": "Legendary",
      "price_money": 1500000,
      "description": "Shoots toxic projectiles. Ability: Acid Blast.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/c/c2/Acidum_Rifle.png/revision/latest?cb=20241223023342",
      "id": "acidum-rifle",
      "wiki_description": "Shoots toxic projectiles. Ability: Acid Blast.",
      "page_description": "The Acidum Rifle is a Rare gun.",
      "trivia": [
        "The Acidum Rifle is widely used in PvP due to its ability to break Instinct, have large AoE stun moves, and extremely high damage.",
        "When equipping this gun, backflip animations when jumping and dashing will not show, although the user is still able to use them.",
        "There may be visual glitches when the Acidum Rifle appears in front of the player's character. This is due to the avatar's arms, and the player will need to change their avatar's arms to fix it.",
        "Acidum Rifle is the only gun that goes around to any players back.",
        "Many players in the community complain about the rework making the Acidum Rifle's moves harder to hit. Although it was \"fixed\", it is still arguably worse than pre-rework."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Acidum%20Rifle"
    },
    {
      "name": "Serpent Bow",
      "rarity": "Legendary",
      "price_money": 2500000,
      "description": "Powerful bow infused with venom. Ability: Venom Arrows.",
      "image_url": "https://raw.githubusercontent.com/natsu5097/bloxgrox/main/images/guns/serpent_bow.png",
      "id": "serpent-bow",
      "wiki_description": "Powerful bow infused with venom. Ability: Venom Arrows.",
      "page_description": "Redirect to:",
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Serpent%20Bow"
    }
  ],
  "accessories": [
    {
      "name": "Black Cape",
      "rarity": "Rare",
      "price_money": 50000,
      "description": "Grants increased health and energy.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/b/bc/Black_Cape.png/revision/latest/scale-to-width-down/268?cb=20241223212648",
      "id": "black-cape",
      "wiki_description": "Grants increased health and energy.",
      "page_description": "The Black Cape is a Rare accessory.",
      "trivia": [
        "It is recommended to obtain the Black Cape as soon as possible due to its buffs being extremely good for players in the First Sea."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Black%20Cape"
    },
    {
      "name": "Pink Coat",
      "rarity": "Rare",
      "price_money": 100000,
      "description": "Increases defense and style.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/d/d9/Pink_Coat.png/revision/latest/scale-to-width-down/268?cb=20241223212836",
      "id": "pink-coat",
      "wiki_description": "Increases defense and style.",
      "page_description": "The Pink Coat is an Uncommon accessory.",
      "trivia": [
        "The Pink Coat is only recommended for gun mains starting out.",
        "Despite a lack of substantial offensive boosts, Pink Coat is commonly used by First and early Second Sea players for the increase in health it provides.\nThe Pink Coat is usually one of the first accessories players obtain, which may be why it is fairly common to see it being used.",
        "The Pink Coat is usually one of the first accessories players obtain, which may be why it is fairly common to see it being used."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Pink%20Coat"
    },
    {
      "name": "Tomoe Ring",
      "rarity": "Rare",
      "price_money": 250000,
      "description": "Boosts fruit ability damage.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/5/5b/Tomoe_Ring.png/revision/latest/scale-to-width-down/268?cb=20241223212958",
      "id": "tomoe-ring",
      "wiki_description": "Boosts fruit ability damage.",
      "page_description": "Tomoe Ring is a Rare accessory.",
      "trivia": [
        "It is not recommended for players to buy the Tomoe Ring because of the high cost. Instead, saving   500,000 to buy other things (Instinct, Water Kung-Fu) is a lot better.",
        "If the player does not meet the requirements to purchase Tomoe Ring, Yoshi will say \"You're not ready yet, brat.\" when spoken to.",
        "The Lv. 575 Boss, Thunder God wears the Tomoe Ring but does not gain any buffs from it.",
        "The Tomoe Ring's description says that it is a metal ring with tomoes, but instead of having tomoes, it has yin-and-yang.",
        "The Tomoe Ring, along with the Swordsman Hat and Lei, are the only accessories that provide a buff to only one stat."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Tomoe%20Ring"
    },
    {
      "name": "Ghoul Mask",
      "rarity": "Legendary",
      "price_money": 1000000,
      "description": "Restores health on damage dealt.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/7/7c/Ghoul_Mask.png/revision/latest/scale-to-width-down/268?cb=20241223212832",
      "id": "ghoul-mask",
      "wiki_description": "Restores health on damage dealt.",
      "page_description": "The Ghoul Mask is a Rare accessory.",
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Ghoul%20Mask"
    }
  ],
  "races": [
    {
      "name": "Human",
      "description": "Balanced stats. Upgrade gives clutch survival abilities.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/6/6e/Human.png/revision/latest/scale-to-width-down/268?cb=20240407190115",
      "id": "human",
      "wiki_description": "Balanced stats. Upgrade gives clutch survival abilities.",
      "page_description": "Human mainly supports damage and a bit of mobility. Due to high damage increases, Human can assist the player greatly when they wish to perform one-shot combos and improve their PvP skills. However, mastering this race is not easy because it does not provide any defense.",
      "trivia": [
        "Combining Human with the Kitsune Ribbon lowers the player's Flash Step cooldown to 7.5 seconds.\nHowever, Psycho (both Tier 1 and 2) while in V4 isn't affected by the buffs granted by the accessory.",
        "However, Psycho (both Tier 1 and 2) while in V4 isn't affected by the buffs granted by the accessory.",
        "Human grants the user a permanent extra dodge for Instinct.",
        "Human deals insane damage when used with high combo potential fruits like Dough."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Human"
    },
    {
      "name": "Rabbit (Mink)",
      "description": "Increased movement speed and agility.",
      "image_url": "https://raw.githubusercontent.com/natsu5097/bloxgrox/main/images/races/rabbit_mink.png",
      "id": "rabbit-mink",
      "wiki_description": "Increased movement speed and agility."
    },
    {
      "name": "Fishman (Shark)",
      "description": "Allows swimming and stronger water attacks.",
      "image_url": "https://raw.githubusercontent.com/natsu5097/bloxgrox/main/images/races/fishman_shark.png",
      "id": "fishman-shark",
      "wiki_description": "Allows swimming and stronger water attacks."
    },
    {
      "name": "Skypian (Angel)",
      "description": "Glide ability and aerial advantages.",
      "image_url": "https://raw.githubusercontent.com/natsu5097/bloxgrox/main/images/races/skypian_angel.png",
      "id": "skypian-angel",
      "wiki_description": "Glide ability and aerial advantages."
    },
    {
      "name": "Cyborg",
      "description": "Energy regeneration and beam attacks.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/a/a3/Cyborg.png/revision/latest/scale-to-width-down/268?cb=20240407190113",
      "id": "cyborg",
      "wiki_description": "Energy regeneration and beam attacks.",
      "page_description": "Cyborg's special abilities allow the player to fight and combo more effectively in close quarters, by disabling Instinct or by dealing extra damage and increasing their own defense. This race is mainly used against teamers due to its ability to deal extremely effective wide-area damage. In general, this race is great for grinding, PvP against Teamers and especially breaking combos. Additionally, it is also good for breaking Instinct and doing combos with Instinct-trickable attacks. However, the V3's average range is also a slight drawback, and the V4's damage output is not a good choice in 1v1s.",
      "trivia": [
        "The damage reduction from Cyborg V2 (10%) and V3 (30%) combined is 37% (not 40%)."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Cyborg"
    },
    {
      "name": "Ghoul",
      "description": "Life steal abilities and night bonuses.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/e/e3/Ghoul.png/revision/latest/scale-to-width-down/268?cb=20240407190114",
      "id": "ghoul",
      "wiki_description": "Life steal abilities and night bonuses.",
      "page_description": "Ghoul provides various stat boosts, most notably increasing the user’s speed during the night and allowing the player to leech health from other players, making it excellent for survivability and overall combat effectiveness. It is a great choice for PvP due to its ability to reduce cooldowns quickly and enhance mobility, alongside powerful life leech when awakened to V4. This race is strong in almost every aspect except for relatively weak armor support, which is compensated for by its life leech abilities. Ghoul does not require switching to another race after obtaining it from the Experimic, similar to Draco.",
      "trivia": [
        "Ghoul V3 with Dino Hood can outrun Mink V3 user with Pilot Helmet."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Ghoul"
    }
  ],
  "locations": [
    {
      "name": "First Sea",
      "description": "Starter sea with basic islands like Jungle, Pirate Village, and Desert.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/3/3c/First_Sea_in_Blox_Fruit_%281%29.jpg/revision/latest/scale-to-width-down/268?cb=20221227112604",
      "id": "first-sea",
      "wiki_description": "Starter sea with basic islands like Jungle, Pirate Village, and Desert.",
      "page_description": "The First Sea is the starter sea for the game and the location that players spawn in when they join the game for the first time.",
      "trivia": [
        "Usually, higher level players are around the Jungle since this is the most popular place in the First Sea."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/First%20Sea"
    },
    {
      "name": "Second Sea",
      "description": "Unlocked at level 700. Includes Dressrosa, Green Zone, and Ice Castle.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/2/25/Second_sea_map.large.jpg/revision/latest/scale-to-width-down/268?cb=20240430030122",
      "id": "second-sea",
      "wiki_description": "Unlocked at level 700. Includes Dressrosa, Green Zone, and Ice Castle.",
      "page_description": "To access the Second Sea, the player must be Level 700 or above. Once they have reached this level, they must talk to the Military Detective and they will receive a special key. They then must travel to the Frozen Village and go to the cave where the Ability Teacher is, opening the wooden door with the previously mentioned key. Inside the cave will be the Ice Admiral, who must be defeated. Once this has been done, the player can return to the Military Detective, who will tell them to talk to the Experienced Captain located on the left side of the Middle Town. Talking to the Experienced Captain will allow the player to travel to the Second Sea.",
      "trivia": [
        "The player can skip going back to the Military Detective as they already have access to the Second Sea even without talking to him.",
        "Awakened Buddha is the most efficient fruit for farming in the Second Sea, due to its M1 range being highly increased."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Second%20Sea"
    },
    {
      "name": "Third Sea",
      "description": "Unlocked at level 1500. Features Floating Turtle, Haunted Castle, and Sea of Treats.",
      "image_url": "https://static.wikia.nocookie.net/roblox-blox-piece/images/b/bc/Updatedbloxfruitsmap25.png/revision/latest/scale-to-width-down/268?cb=20250827195858",
      "id": "third-sea",
      "wiki_description": "Unlocked at level 1500. Features Floating Turtle, Haunted Castle, and Sea of Treats.",
      "page_description": "Players can get access to the Third Sea by reaching Lv. 1500, after completing the Colosseum Quest, defeating Don Swan and helping King Red Head subdue rip_indra in the Second Sea.",
      "trivia": [
        "The Third Sea holds the title of having the least number of islands (8); however, more are to come. It also could be counted as 12 islands, as there are several mini-islands in the Sea of Treats or 17 if the Mirage Island, Kitsune Island, Treasure Island, Frozen Dimension and Prehistoric Island are included.",
        "The enemies past the Ice Cream Land (Sea of Treats) use Aura, nullifying Elemental Reflex even if the player surpasses the required Level."
      ],
      "_wiki_source": "https://blox-fruits.fandom.com/wiki/Third%20Sea"
    }
  ],
  "updates": [
    {
      "version": "Update 27",
      "date": "2025-01-20",
      "details": "Added Kitsune fruit, new swords, bug fixes, balance changes.",
      "wiki_description": ""
    },
    {
      "version": "Update 26",
      "date": "2024-09-10",
      "details": "Added Celestial and Creation fruits, new race abilities, awakened sound fruit.",
      "wiki_description": ""
    },
    {
      "version": "Update 25",
      "date": "2024-04-15",
      "details": "Added T-Rex and Mammoth fruits, new raids, and fighting style buffs.",
      "wiki_description": ""
    }
  ]
}